var max_pnmu = 0;
var TIME_SPAN_SECOND = 1000;//
var TIME_SPAN_MINUTES = 1000*60;
var fuc_num;

var _swiper = 0;

function areaName(Num){
	switch(Num){
	case '0':
		break;
	case '1':
		return '黄浦';
	case '2':
		return '徐汇';
	case '3':
		return '长宁';
	case '4':
		return '崇明';
	case '5':
		return '普陀';
	case '6':
		return '金山';
	case '7':
		return '杨浦';
	case '8':
		return '闵行';
	case '9':
		return '宝山';
	case '10':
		return '浦东';
	case '11':
		return '奉贤';
	case '12':
		return '松江';
	case '13':
		return '黄浦区图书馆';
	case '14':
		return '黄浦区文化馆';
	case '15':
		return '五里桥社区文化活动中心';
	case '16':
		return '上海大世界传艺中心';
	case '17':
		return '打浦桥社区文化活动中心';
	case '18':
		return '淮海街道社区文化活动中心';
	case '19':
		return '凌云社区文化活动中心';
	case '20':
		return '枫林街道社区文化活动中心';
	case '21':
		return '华泾社区文化活动中心';
	case '22':
		return '徐家汇社区文化活动中心';
	case '23':
		return '徐汇区图书馆';
	case '24':
		return '斜土路街道社区文化活动中心';
	case '25':
		return '长宁文化艺术中心';
	case '26':
		return '上海市长宁区少年儿童图书馆';
	case '27':
		return '长宁区图书馆';
	case '28':
		return '天山社区文化活动中心';
	case '29':
		return '新泾镇社区文化活动中心';
	case '30':
		return '长宁民俗文化中心';
	case '31':
		return '崇明区图书馆';
	case '32':
		return '崇明区文化馆';
	case '33':
		return '陈家镇社区文化活动中心';
	case '34':
		return '庙镇社区文化活动中心';
	case '35':
		return '横沙社区文化活动中心';
	case '36':
		return '城桥镇社区文化活动中心';
	case '37':
		return '普陀区桃浦文化馆';
	case '38':
		return '普陀区图书馆';
	case '39':
		return '宜川社区文化活动中心';
	case '40':
		return '普陀区少年儿童图书馆';
	case '41':
		return '曹杨社区文化活动中心';
	case '42':
		return '长风社区文化活动中心';
	case '43':
		return '金山区图书馆';
	case '44':
		return '金山区文化馆';
	case '45':
		return '金山工业区社区文化活动中心';
	case '46':
		return '朱泾镇社区文化活动中心';
	case '47':
		return '张堰镇社区文化活动中心';
	case '48':
		return '山阳镇社区文化活动中心';
	case '49':
		return '长白街道社区文化活动中心';
	case '50':
		return '五角场街道社区文化活动中心';
	case '51':
		return '杨浦区图书馆';
	case '52':
		return '四平街道社区文化活动中心二期';
	case '53':
		return '新江湾城社区文化活动中心';
	case '54':
		return '五角场镇社区文化活动中心';
	case '55':
		return '闵行区图书馆';
	case '56':
		return '闵行区群众艺术馆';
	case '57':
		return '浦江镇社区文化活动中心';
	case '58':
		return '颛桥镇社区文化活动中心';
	case '59':
		return '七宝镇文化体育事业发展中心';
	case '60':
		return '梅陇镇文化体育发展事业中心';
	case '61':
		return '宝山区图书馆';
	case '62':
		return '宝山区文化馆';
	case '63':
		return '宝山区月浦文化馆';
	case '64':
		return '庙行镇社区文化活动中心';
	case '65':
		return '大场镇社区文化活动中心';
	case '66':
		return '张庙社区文化活动中心';
	case '67':
		return '航头镇文化服务中心';
	case '68':
		return '高行镇社区文化活动中心';
	case '69':
		return '周浦镇文化活动中心';
	case '70':
		return '惠南镇社区文化活动中心';
	case '71':
		return '祝桥镇社区文化活动中心';
	case '72':
		return '书院镇社区文化活动中心';
	case '73':
		return '奉贤区图书馆';
	case '74':
		return '奉贤区文化馆';
	case '75':
		return '青村镇社区文化活动中心';
	case '76':
		return '奉城镇社区文化活动中心';
	case '77':
		return '金汇镇社区文化活动中心';
	case '78':
		return '四团镇社区文化活动中心';
	case '79':
		return '松江区图书馆';
	case '80':
		return '松江区文化馆';
	case '81':
		return '松江区文化资源配送中心';
	case '82':
		return '新桥镇社区文化活动中心';
	case '83':
		return '洞泾镇社区文化活动中心';
	case '84':
		return '岳阳街道社区文化活动中心';
	case '85':
		return '虹口';
	case '86':
		return '嘉定';
	case '87':
		return '青浦';
	case '88':
		return '静安';
		
	case '91':
		return '嘉兴路街道社区文化活动中心';
	case '92':
		return '四川北路街道社区文化活动中心';
	case '93':
		return '广中路街道社区文化活动中心';
	case '94':
		return '江湾镇街道社区文化活动中心';
	case '95':
		return '虹口区图书馆';
	case '96':
		return '虹口区文化馆';
		
	case '97':
		return '徐泾镇社区文化活动中心';
	case '98':
		return '朱家角镇社区文化活动中心';
	case '99':
		return '白鹤镇社区文化活动中心';
	case '100':
		return '练塘镇社区文化活动中心';
	case '101':
		return '赵巷镇社区文化活动中心';
	case '102':
		return '重固镇社区文化活动中心';
		
		
	case '2017.01':
		return '1';
	case '2017.02':
		return '2';
	case '2017.03':
		return '3';
	case '2017.04':
		return '4';
	case '2017.05':
		return '5';
	case '2017.06':
		return '6';
	case '2017.07':
		return '7';
	case '2017.08':
		return '8';
	case '2017.09':
		return '9';
	case '2017.10':
		return '10';
	case '2017.11':
		return '11';
	case '2017.12':
		return '12';
	case 'all':
		return '0';
		
		
	case 'assessDiv':
		return 'assessDiv';
	case 'assessDiv2':
		return 'assessDiv2';
	case 'assessDiv3':
		return 'assessDiv3';
	case 'assessDiv4':
		return 'assessDiv4';
	case 'assessDiv5':
		return 'assessDiv5';
	case 'assessDiv6':
		return 'assessDiv6';
		
		/*嘉定*/
	/*case '103':
		return '南翔镇社区文化活动中心';
	case '104':
		return '嘉定区图书馆';
	case '105':
		return '嘉定区文化馆';
	case '106':
		return '安亭镇文体活动中心方泰分中心';
	case '107':
		return '真新街道社区文化活动中心';
	case '108':
		return '菊园新区社区文化活动中心';*/
		
	default:
		break;
	}
}
//、、、崇明、、、、金山、、、、




//绩效大数据
var assess = {"mon10":{"zhpm":[{"num":"1","place":"嘉定区"},{"num":"2","place":"黄浦区"},{"num":"3","place":"金山区"},{"num":"4","place":"宝山区"},{"num":"5","place":"崇明区"},{"num":"6","place":"徐汇区"},{"num":"7","place":"浦东新区"},{"num":"8","place":"长宁区"},{"num":"9","place":"闵行区"},{"num":"10","place":"松江区"},{"num":"11","place":"普陀区"},{"num":"12","place":"虹口区"},{"num":"13","place":"杨浦区"},{"num":"14","place":"奉贤区"},{"num":"15","place":"青浦区"},{"num":"16","place":"静安区"}],"hdfbl":[{"num":"1","place":"黄浦区","act":"856"},{"num":"2","place":"金山区","act":"817"},{"num":"3","place":"闵行区","act":"755"},{"num":"4","place":"徐汇区","act":"630"},{"num":"5","place":"长宁区","act":"598"},{"num":"6","place":"浦东新区","act":"575"},{"num":"7","place":"崇明区","act":"564"},{"num":"8","place":"宝山区","act":"484"},{"num":"9","place":"静安区","act":"269"},{"num":"10","place":"嘉定区","act":"245"},{"num":"11","place":"普陀区","act":"244"},{"num":"12","place":"奉贤区","act":"239"},{"num":"13","place":"松江区","act":"204"},{"num":"14","place":"虹口区","act":"202"},{"num":"15","place":"杨浦区","act":"119"},{"num":"16","place":"青浦区","act":"113"}],"kyyhd":[{"num":"1","place":"黄浦区","act":"689"},{"num":"2","place":"徐汇区","act":"453"},{"num":"3","place":"宝山区","act":"367"},{"num":"4","place":"闵行区","act":"213"},{"num":"5","place":"崇明区","act":"210"},{"num":"6","place":"嘉定区","act":"207"},{"num":"7","place":"浦东新区","act":"121"},{"num":"8","place":"普陀区","act":"103"},{"num":"9","place":"杨浦区","act":"66"},{"num":"10","place":"虹口区","act":"29"},{"num":"11","place":"松江区","act":"22"},{"num":"12","place":"奉贤区","act":"22"},{"num":"13","place":"金山区","act":"21"},{"num":"14","place":"静安区","act":"17"},{"num":"15","place":"长宁区","act":"8"},{"num":"16","place":"青浦区","act":"0"}],"gjfbl":[{"num":"1","place":"金山区","act":"51.06"},{"num":"2","place":"黄浦区","act":"47.56"},{"num":"3","place":"闵行区","act":"41.94"},{"num":"4","place":"徐汇区","act":"39.38"},{"num":"5","place":"长宁区","act":"37.38"},{"num":"6","place":"宝山区","act":"28.47"},{"num":"7","place":"崇明区","act":"25.64"},{"num":"8","place":"虹口区","act":"16.83"},{"num":"9","place":"嘉定区","act":"16.33"},{"num":"10","place":"奉贤区","act":"15.93"},{"num":"11","place":"普陀区","act":"14.35"},{"num":"12","place":"浦东新区","act":"13.37"},{"num":"13","place":"静安区","act":"12.81"},{"num":"14","place":"松江区","act":"9.27"},{"num":"15","place":"青浦区","act":"8.07"},{"num":"16","place":"杨浦区","act":"7.93"}],"gjyyl":[{"num":"1","place":"松江区","act":"95.5%"},{"num":"2","place":"长宁区","act":"85.9%"},{"num":"3","place":"嘉定区","act":"85.9%"},{"num":"4","place":"金山区","act":"76.4%"},{"num":"5","place":"浦东新区","act":"60.3%"},{"num":"6","place":"黄浦区","act":"50.4%"},{"num":"7","place":"虹口区","act":"28.1%"},{"num":"8","place":"崇明区","act":"18.9%"},{"num":"9","place":"普陀区","act":"13.7%"},{"num":"10","place":"宝山区","act":"11.4%"},{"num":"11","place":"徐汇区","act":"11.2%"},{"num":"12","place":"闵行区","act":"7.5%"},{"num":"13","place":"杨浦区","act":"4.1%"},{"num":"14","place":"青浦区","act":"0.0%"},{"num":"15","place":"静安区","act":"0.0%"},{"num":"16","place":"奉贤区","act":"0.0%"}],"hdskyyl":[{"num":"1","place":"崇明区","act":"142"},{"num":"2","place":"嘉定区","act":"130"},{"num":"3","place":"金山区","act":"80"},{"num":"4","place":"宝山区","act":"79"},{"num":"5","place":"黄浦区","act":"67"},{"num":"6","place":"徐汇区","act":"43"},{"num":"7","place":"青浦区","act":"36"},{"num":"8","place":"浦东新区","act":"31"},{"num":"9","place":"杨浦区","act":"22"},{"num":"10","place":"长宁区","act":"19"},{"num":"11","place":"普陀区","act":"16"},{"num":"12","place":"闵行区","act":"16"},{"num":"13","place":"虹口区","act":"10"},{"num":"14","place":"松江区","act":"6"},{"num":"15","place":"奉贤区","act":"5"},{"num":"16","place":"静安区","act":"0"}]},"mon9":{"zhpm":[{"num":"1","place":"嘉定区"},{"num":"2","place":"黄浦区"},{"num":"3","place":"长宁区"},{"num":"4","place":"金山区"},{"num":"5","place":"宝山区"},{"num":"6","place":"浦东新区"},{"num":"7","place":"徐汇区"},{"num":"8","place":"闵行区"},{"num":"9","place":"崇明区"},{"num":"10","place":"虹口区"},{"num":"11","place":"松江区"},{"num":"12","place":"普陀区"},{"num":"13","place":"杨浦区"},{"num":"14","place":"静安区"},{"num":"15","place":"青浦区"},{"num":"16","place":"奉贤区"}],"hdfbl":[{"num":"1","place":"闵行区","act":"878"},{"num":"2","place":"静安区","act":"849"},{"num":"3","place":"黄浦区","act":"817"},{"num":"4","place":"金山区","act":"798"},{"num":"5","place":"浦东新区","act":"675"},{"num":"6","place":"崇明区","act":"675"},{"num":"7","place":"徐汇区","act":"645"},{"num":"8","place":"长宁区","act":"634"},{"num":"9","place":"宝山区","act":"622"},{"num":"10","place":"嘉定区","act":"248"},{"num":"11","place":"普陀区","act":"200"},{"num":"12","place":"青浦区","act":"197"},{"num":"13","place":"奉贤区","act":"188"},{"num":"14","place":"虹口区","act":"184"},{"num":"15","place":"杨浦区","act":"151"},{"num":"16","place":"松江区","act":"143"}],"kyyhd":[{"num":"1","place":"黄浦区","act":"633"},{"num":"2","place":"徐汇区","act":"464"},{"num":"3","place":"宝山区","act":"457"},{"num":"4","place":"闵行区","act":"278"},{"num":"5","place":"嘉定区","act":"196"},{"num":"6","place":"崇明区","act":"184"},{"num":"7","place":"浦东新区","act":"92"},{"num":"8","place":"杨浦区","act":"87"},{"num":"9","place":"普陀区","act":"66"},{"num":"10","place":"奉贤区","act":"39"},{"num":"11","place":"虹口区","act":"33"},{"num":"12","place":"长宁区","act":"19"},{"num":"13","place":"金山区","act":"15"},{"num":"14","place":"松江区","act":"8"},{"num":"15","place":"青浦区","act":"2"},{"num":"16","place":"静安区","act":"0"}],"gjfbl":[{"num":"1","place":"金山区","act":"49.88"},{"num":"2","place":"闵行区","act":"48.78"},{"num":"3","place":"黄浦区","act":"45.39"},{"num":"4","place":"静安区","act":"40.43"},{"num":"5","place":"徐汇区","act":"40.31"},{"num":"6","place":"长宁区","act":"39.63"},{"num":"7","place":"宝山区","act":"36.59"},{"num":"8","place":"崇明区","act":"30.63"},{"num":"9","place":"嘉定区","act":"16.53"},{"num":"10","place":"浦东新区","act":"15.70"},{"num":"11","place":"虹口区","act":"15.33"},{"num":"12","place":"青浦区","act":"14.07"},{"num":"13","place":"奉贤区","act":"12.53"},{"num":"14","place":"普陀区","act":"11.76"},{"num":"15","place":"杨浦区","act":"10.07"},{"num":"16","place":"松江区","act":"6.50"}],"gjyyl":[{"num":"1","place":"长宁区","act":"93.7%"},{"num":"2","place":"松江区","act":"88.4%"},{"num":"3","place":"嘉定区","act":"80.1%"},{"num":"4","place":"浦东新区","act":"59.6%"},{"num":"5","place":"虹口区","act":"53.7%"},{"num":"6","place":"金山区","act":"45.0%"},{"num":"7","place":"黄浦区","act":"27.7%"},{"num":"8","place":"宝山区","act":"11.6%"},{"num":"9","place":"徐汇区","act":"10.1%"},{"num":"10","place":"普陀区","act":"8.7%"},{"num":"11","place":"杨浦区","act":"8.3%"},{"num":"12","place":"闵行区","act":"0.5%"},{"num":"13","place":"崇明区","act":"0.2%"},{"num":"14","place":"青浦区","act":"0.0%"},{"num":"15","place":"静安区","act":"0.0%"},{"num":"16","place":"奉贤区","act":"0.0%"}],"hdskyyl":[{"num":"1","place":"崇明区","act":"142"},{"num":"2","place":"嘉定区","act":"130"},{"num":"3","place":"黄浦区","act":"66"},{"num":"4","place":"金山区","act":"60"},{"num":"5","place":"宝山区","act":"52"},{"num":"6","place":"徐汇区","act":"43"},{"num":"7","place":"青浦区","act":"36"},{"num":"8","place":"浦东新区","act":"31"},{"num":"9","place":"杨浦区","act":"22"},{"num":"10","place":"长宁区","act":"19"},{"num":"11","place":"闵行区","act":"16"},{"num":"12","place":"普陀区","act":"14"},{"num":"13","place":"虹口区","act":"9"},{"num":"14","place":"松江区","act":"6"},{"num":"15","place":"奉贤区","act":"5"},{"num":"16","place":"静安区","act":"0"}]},"mon8":{"zhpm":[{"num":"1","place":"黄浦区"},{"num":"2","place":"宝山区"},{"num":"3","place":"闵行区"},{"num":"4","place":"崇明区"},{"num":"5","place":"徐汇区"},{"num":"6","place":"嘉定区"},{"num":"7","place":"金山区"},{"num":"8","place":"浦东新区"},{"num":"9","place":"杨浦区"},{"num":"10","place":"普陀区"},{"num":"11","place":"长宁区"},{"num":"12","place":"虹口区"},{"num":"13","place":"静安区"},{"num":"14","place":"青浦区"},{"num":"15","place":"松江区"},{"num":"16","place":"奉贤区"}],"hdfbl":[{"num":"1","place":"闵行区","act":"869"},{"num":"2","place":"黄浦区","act":"769"},{"num":"3","place":"金山区","act":"731"},{"num":"4","place":"崇明区","act":"679"},{"num":"5","place":"浦东新区","act":"675"},{"num":"6","place":"静安区","act":"657"},{"num":"7","place":"宝山区","act":"582"},{"num":"8","place":"徐汇区","act":"542"},{"num":"9","place":"长宁区","act":"528"},{"num":"10","place":"嘉定区","act":"241"},{"num":"11","place":"普陀区","act":"225"},{"num":"12","place":"奉贤区","act":"194"},{"num":"13","place":"虹口区","act":"183"},{"num":"14","place":"杨浦区","act":"173"},{"num":"15","place":"青浦区","act":"151"},{"num":"16","place":"松江区","act":"139"}],"kyyhd":[{"num":"1","place":"黄浦区","act":"543"},{"num":"2","place":"宝山区","act":"496"},{"num":"3","place":"徐汇区","act":"382"},{"num":"4","place":"闵行区","act":"274"},{"num":"5","place":"嘉定区","act":"203"},{"num":"6","place":"崇明区","act":"167"},{"num":"7","place":"浦东新区","act":"110"},{"num":"8","place":"普陀区","act":"91"},{"num":"9","place":"虹口区","act":"32"},{"num":"10","place":"杨浦区","act":"28"},{"num":"11","place":"长宁区","act":"16"},{"num":"12","place":"松江区","act":"15"},{"num":"13","place":"金山区","act":"13"},{"num":"14","place":"奉贤区","act":"6"},{"num":"15","place":"青浦区","act":"1"},{"num":"16","place":"静安区","act":"0"}],"gjfbl":[{"num":"1","place":"闵行区","act":"48.28"},{"num":"2","place":"金山区","act":"45.69"},{"num":"3","place":"黄浦区","act":"42.72"},{"num":"4","place":"宝山区","act":"34.24"},{"num":"5","place":"徐汇区","act":"33.88"},{"num":"6","place":"长宁区","act":"33.00"},{"num":"7","place":"静安区","act":"31.29"},{"num":"8","place":"崇明区","act":"30.86"},{"num":"9","place":"嘉定区","act":"16.07"},{"num":"10","place":"浦东新区","act":"15.70"},{"num":"11","place":"虹口区","act":"15.25"},{"num":"12","place":"普陀区","act":"13.24"},{"num":"13","place":"奉贤区","act":"12.93"},{"num":"14","place":"杨浦区","act":"11.53"},{"num":"15","place":"青浦区","act":"10.79"},{"num":"16","place":"松江区","act":"6.32"}],"gjyyl":[{"num":"1","place":"宝山区","act":"85.22%"},{"num":"2","place":"嘉定区","act":"84.23%"},{"num":"3","place":"黄浦区","act":"70.61%"},{"num":"4","place":"徐汇区","act":"70.48%"},{"num":"5","place":"普陀区","act":"40.44%"},{"num":"6","place":"闵行区","act":"31.53%"},{"num":"7","place":"崇明区","act":"24.59%"},{"num":"8","place":"虹口区","act":"17.49%"},{"num":"9","place":"浦东新区","act":"16.30%"},{"num":"10","place":"杨浦区","act":"16.18%"},{"num":"11","place":"松江区","act":"10.79%"},{"num":"12","place":"奉贤区","act":"3.09%"},{"num":"13","place":"长宁区","act":"1.78%"},{"num":"14","place":"金山区","act":"1.78%"},{"num":"15","place":"青浦区","act":"0.66%"},{"num":"16","place":"静安区","act":"0.00%"}],"hdskyyl":[{"num":"1","place":"崇明区","act":"142"},{"num":"2","place":"嘉定区","act":"130"},{"num":"3","place":"宝山区","act":"51"},{"num":"4","place":"金山区","act":"50"},{"num":"5","place":"黄浦区","act":"45"},{"num":"6","place":"徐汇区","act":"43"},{"num":"7","place":"青浦区","act":"36"},{"num":"8","place":"浦东新区","act":"24"},{"num":"9","place":"杨浦区","act":"22"},{"num":"10","place":"长宁区","act":"19"},{"num":"11","place":"普陀区","act":"14"},{"num":"12","place":"闵行区","act":"14"},{"num":"13","place":"虹口区","act":"9"},{"num":"14","place":"松江区","act":"5"},{"num":"15","place":"奉贤区","act":"5"},{"num":"16","place":"静安区","act":"0"}]},"mon7":{"zhpm":[{"num":"1","place":"宝山区"},{"num":"2","place":"黄浦区"},{"num":"3","place":"徐汇区"},{"num":"4","place":"闵行区"},{"num":"5","place":"嘉定区"},{"num":"6","place":"崇明区"},{"num":"7","place":"金山区"},{"num":"8","place":"长宁区"},{"num":"9","place":"杨浦区"},{"num":"10","place":"普陀区"},{"num":"11","place":"虹口区"},{"num":"12","place":"浦东新区"},{"num":"13","place":"静安区"},{"num":"14","place":"松江区"},{"num":"15","place":"奉贤区"},{"num":"16","place":"青浦区"}],"hdfbl":[{"num":"1","place":"闵行区","act":"990"},{"num":"2","place":"金山区","act":"823"},{"num":"3","place":"静安区","act":"740"},{"num":"4","place":"黄浦区","act":"699"},{"num":"5","place":"宝山区","act":"645"},{"num":"6","place":"徐汇区","act":"617"},{"num":"7","place":"长宁区","act":"554"},{"num":"8","place":"崇明区","act":"515"},{"num":"9","place":"浦东新区","act":"490"},{"num":"10","place":"嘉定区","act":"293"},{"num":"11","place":"普陀区","act":"248"},{"num":"12","place":"奉贤区","act":"242"},{"num":"13","place":"虹口区","act":"236"},{"num":"14","place":"松江区","act":"189"},{"num":"15","place":"杨浦区","act":"181"},{"num":"16","place":"青浦区","act":"136"}],"kyyhd":[{"num":"1","place":"宝山区","act":"519"},{"num":"2","place":"徐汇区","act":"412"},{"num":"3","place":"黄浦区","act":"403"},{"num":"4","place":"闵行区","act":"335"},{"num":"5","place":"嘉定区","act":"248"},{"num":"6","place":"崇明区","act":"119"},{"num":"7","place":"杨浦区","act":"116"},{"num":"8","place":"普陀区","act":"91"},{"num":"9","place":"虹口区","act":"44"},{"num":"10","place":"浦东新区","act":"41"},{"num":"11","place":"松江区","act":"34"},{"num":"12","place":"长宁区","act":"26"},{"num":"13","place":"金山区","act":"15"},{"num":"14","place":"奉贤区","act":"7"},{"num":"15","place":"青浦区","act":"2"},{"num":"16","place":"静安区","act":"0"}],"gjfbl":[{"num":"1","place":"闵行区","act":"55.00"},{"num":"2","place":"金山区","act":"51.44"},{"num":"3","place":"黄浦区","act":"38.83"},{"num":"4","place":"徐汇区","act":"38.56"},{"num":"5","place":"宝山区","act":"37.94"},{"num":"6","place":"静安区","act":"35.24"},{"num":"7","place":"长宁区","act":"34.63"},{"num":"8","place":"崇明区","act":"23.41"},{"num":"9","place":"虹口区","act":"19.67"},{"num":"10","place":"嘉定区","act":"19.53"},{"num":"11","place":"奉贤区","act":"16.13"},{"num":"12","place":"普陀区","act":"14.59"},{"num":"13","place":"杨浦区","act":"12.07"},{"num":"14","place":"浦东新区","act":"11.40"},{"num":"15","place":"青浦区","act":"9.71"},{"num":"16","place":"松江区","act":"8.59"}],"gjyyl":[{"num":"1","place":"嘉定区","act":"84.64%"},{"num":"2","place":"宝山区","act":"80.47%"},{"num":"3","place":"徐汇区","act":"66.77%"},{"num":"4","place":"杨浦区","act":"64.09%"},{"num":"5","place":"黄浦区","act":"57.65%"},{"num":"6","place":"普陀区","act":"36.69%"},{"num":"7","place":"闵行区","act":"33.84%"},{"num":"8","place":"崇明区","act":"23.11%"},{"num":"9","place":"虹口区","act":"18.64%"},{"num":"10","place":"松江区","act":"17.99%"},{"num":"11","place":"浦东新区","act":"8.37%"},{"num":"12","place":"长宁区","act":"4.69%"},{"num":"13","place":"奉贤区","act":"2.89%"},{"num":"14","place":"金山区","act":"1.82%"},{"num":"15","place":"青浦区","act":"1.47%"},{"num":"16","place":"静安区","act":"0.00%"}],"hdskyyl":[{"num":"1","place":"崇明区","act":"142"},{"num":"2","place":"嘉定区","act":"130"},{"num":"3","place":"宝山区","act":"51"},{"num":"4","place":"金山区","act":"50"},{"num":"5","place":"黄浦区","act":"45"},{"num":"6","place":"徐汇区","act":"43"},{"num":"7","place":"青浦区","act":"36"},{"num":"8","place":"杨浦区","act":"22"},{"num":"9","place":"长宁区","act":"19"},{"num":"10","place":"普陀区","act":"14"},{"num":"11","place":"闵行区","act":"14"},{"num":"12","place":"浦东新区","act":"12"},{"num":"13","place":"虹口区","act":"9"},{"num":"14","place":"松江区","act":"5"},{"num":"15","place":"奉贤区","act":"5"},{"num":"16","place":"静安区","act":"0"}]},"mon6":{"zhpm":[{"num":"1","place":"宝山区"},{"num":"2","place":"徐汇区"},{"num":"3","place":"黄浦区"},{"num":"4","place":"崇明区"},{"num":"5","place":"闵行区"},{"num":"6","place":"嘉定区"},{"num":"7","place":"金山区"},{"num":"8","place":"长宁区"},{"num":"9","place":"杨浦区"},{"num":"10","place":"普陀区"},{"num":"11","place":"浦东新区"},{"num":"12","place":"静安区"},{"num":"13","place":"虹口区"},{"num":"14","place":"奉贤区"},{"num":"15","place":"青浦区"},{"num":"16","place":"松江区"}],"hdfbl":[{"num":"1","place":"闵行区","act":"948"},{"num":"2","place":"黄浦区","act":"610"},{"num":"3","place":"徐汇区","act":"600"},{"num":"4","place":"宝山区","act":"594"},{"num":"5","place":"静安区","act":"591"},{"num":"6","place":"崇明区","act":"488"},{"num":"7","place":"长宁区","act":"486"},{"num":"8","place":"金山区","act":"477"},{"num":"9","place":"浦东新区","act":"471"},{"num":"10","place":"嘉定区","act":"232"},{"num":"11","place":"奉贤区","act":"223"},{"num":"12","place":"普陀区","act":"179"},{"num":"13","place":"杨浦区","act":"170"},{"num":"14","place":"青浦区","act":"159"},{"num":"15","place":"虹口区","act":"157"},{"num":"16","place":"松江区","act":"150"}],"kyyhd":[{"num":"1","place":"宝山区","act":"487"},{"num":"2","place":"徐汇区","act":"426"},{"num":"3","place":"黄浦区","act":"402"},{"num":"4","place":"闵行区","act":"276"},{"num":"5","place":"嘉定区","act":"182"},{"num":"6","place":"崇明区","act":"127"},{"num":"7","place":"杨浦区","act":"88"},{"num":"8","place":"浦东新区","act":"70"},{"num":"9","place":"普陀区","act":"60"},{"num":"10","place":"松江区","act":"34"},{"num":"11","place":"虹口区","act":"26"},{"num":"12","place":"长宁区","act":"19"},{"num":"13","place":"奉贤区","act":"17"},{"num":"14","place":"金山区","act":"10"},{"num":"15","place":"青浦区","act":"3"},{"num":"16","place":"静安区","act":"0"}],"gjfbl":[{"num":"1","place":"闵行区","act":"52.67"},{"num":"2","place":"宝山区","act":"39.60"},{"num":"3","place":"徐汇区","act":"37.50"},{"num":"4","place":"黄浦区","act":"33.89"},{"num":"5","place":"长宁区","act":"30.38"},{"num":"6","place":"金山区","act":"29.81"},{"num":"7","place":"静安区","act":"28.14"},{"num":"8","place":"崇明区","act":"22.18"},{"num":"9","place":"嘉定区","act":"15.47"},{"num":"10","place":"奉贤区","act":"14.87"},{"num":"11","place":"虹口区","act":"13.08"},{"num":"12","place":"青浦区","act":"11.36"},{"num":"13","place":"杨浦区","act":"11.33"},{"num":"14","place":"浦东新区","act":"10.95"},{"num":"15","place":"普陀区","act":"10.53"},{"num":"16","place":"松江区","act":"6.82"}],"gjyyl":[{"num":"1","place":"崇明区","act":"100%"},{"num":"2","place":"宝山区","act":"81.99%"},{"num":"3","place":"嘉定区","act":"78.45%"},{"num":"4","place":"徐汇区","act":"71.00%"},{"num":"5","place":"黄浦区","act":"65.90%"},{"num":"6","place":"杨浦区","act":"51.76%"},{"num":"7","place":"普陀区","act":"33.52%"},{"num":"8","place":"闵行区","act":"29.11%"},{"num":"9","place":"松江区","act":"22.67%"},{"num":"10","place":"虹口区","act":"16.56%"},{"num":"11","place":"浦东新区","act":"14.86%"},{"num":"12","place":"奉贤区","act":"7.62%"},{"num":"13","place":"长宁区","act":"3.91%"},{"num":"14","place":"金山区","act":"2.10%"},{"num":"15","place":"青浦区","act":"1.89%"},{"num":"16","place":"静安区","act":"0.00%"}],"hdskyyl":[{"num":"1","place":"崇明区","act":"142"},{"num":"2","place":"嘉定区","act":"130"},{"num":"3","place":"金山区","act":"50"},{"num":"4","place":"黄浦区","act":"46"},{"num":"5","place":"宝山区","act":"45"},{"num":"6","place":"徐汇区","act":"43"},{"num":"7","place":"青浦区","act":"33"},{"num":"8","place":"杨浦区","act":"22"},{"num":"9","place":"长宁区","act":"19"},{"num":"10","place":"闵行区","act":"14"},{"num":"11","place":"普陀区","act":"13"},{"num":"12","place":"浦东新区","act":"12"},{"num":"13","place":"虹口区","act":"9"},{"num":"14","place":"奉贤区","act":"5"},{"num":"15","place":"松江区","act":"4"},{"num":"16","place":"静安区","act":"0"}]},"mon5":{"zhpm":[{"num":"1","place":"宝山区"},{"num":"2","place":"黄浦区"},{"num":"3","place":"徐汇区"},{"num":"4","place":"闵行区"},{"num":"5","place":"崇明区"},{"num":"6","place":"嘉定区"},{"num":"7","place":"杨浦区"},{"num":"8","place":"长宁区"},{"num":"9","place":"金山区"},{"num":"10","place":"普陀区"},{"num":"11","place":"浦东新区"},{"num":"12","place":"静安区"},{"num":"13","place":"虹口区"},{"num":"14","place":"奉贤区"},{"num":"15","place":"青浦区"},{"num":"16","place":"松江区"}],"hdfbl":[{"num":"1","place":"闵行区","act":"919"},{"num":"2","place":"静安区","act":"745"},{"num":"3","place":"徐汇区","act":"664"},{"num":"4","place":"崇明区","act":"659"},{"num":"5","place":"黄浦区","act":"613"},{"num":"6","place":"宝山区","act":"556"},{"num":"7","place":"长宁区","act":"376"},{"num":"8","place":"浦东新区","act":"376"},{"num":"9","place":"金山区","act":"341"},{"num":"10","place":"奉贤区","act":"306"},{"num":"11","place":"嘉定区","act":"228"},{"num":"12","place":"普陀区","act":"194"},{"num":"13","place":"杨浦区","act":"174"},{"num":"14","place":"虹口区","act":"172"},{"num":"15","place":"青浦区","act":"169"},{"num":"16","place":"松江区","act":"101"}],"kyyhd":[{"num":"1","place":"黄浦区","act":"437"},{"num":"2","place":"宝山区","act":"431"},{"num":"3","place":"徐汇区","act":"353"},{"num":"4","place":"闵行区","act":"266"},{"num":"5","place":"嘉定区","act":"174"},{"num":"6","place":"崇明区","act":"133"},{"num":"7","place":"杨浦区","act":"108"},{"num":"8","place":"普陀区","act":"74"},{"num":"9","place":"浦东新区","act":"66"},{"num":"10","place":"虹口区","act":"34"},{"num":"11","place":"长宁区","act":"30"},{"num":"12","place":"松江区","act":"19"},{"num":"13","place":"奉贤区","act":"18"},{"num":"14","place":"青浦区","act":"5"},{"num":"15","place":"金山区","act":"5"},{"num":"16","place":"静安区","act":"0"}],"gjfbl":[{"num":"1","place":"闵行区","act":"54.06"},{"num":"2","place":"徐汇区","act":"41.50"},{"num":"3","place":"宝山区","act":"37.07"},{"num":"4","place":"静安区","act":"35.48"},{"num":"5","place":"黄浦区","act":"34.06"},{"num":"6","place":"崇明区","act":"29.95"},{"num":"7","place":"长宁区","act":"23.50"},{"num":"8","place":"金山区","act":"21.31"},{"num":"9","place":"奉贤区","act":"20.40"},{"num":"10","place":"嘉定区","act":"15.20"},{"num":"11","place":"虹口区","act":"14.33"},{"num":"12","place":"青浦区","act":"12.07"},{"num":"13","place":"杨浦区","act":"11.60"},{"num":"14","place":"普陀区","act":"11.41"},{"num":"15","place":"浦东新区","act":"8.74"},{"num":"16","place":"松江区","act":"4.59"}],"gjyyl":[{"num":"1","place":"宝山区","act":"77.52%"},{"num":"2","place":"嘉定区","act":"76.32%"},{"num":"3","place":"黄浦区","act":"71.29%"},{"num":"4","place":"杨浦区","act":"62.07%"},{"num":"5","place":"徐汇区","act":"53.16%"},{"num":"6","place":"普陀区","act":"33.14%"},{"num":"7","place":"闵行区","act":"28.94%"},{"num":"8","place":"崇明区","act":"20.18%"},{"num":"9","place":"虹口区","act":"19.77%"},{"num":"10","place":"松江区","act":"18.81%"},{"num":"11","place":"浦东新区","act":"17.55%"},{"num":"12","place":"长宁区","act":"7.98%"},{"num":"13","place":"奉贤区","act":"5.88%"},{"num":"14","place":"青浦区","act":"2.96%"},{"num":"15","place":"金山区","act":"1.47%"},{"num":"16","place":"静安区","act":"0.00%"}],"hdskyyl":[{"num":"1","place":"崇明区","act":"142"},{"num":"2","place":"嘉定区","act":"125"},{"num":"3","place":"金山区","act":"57"},{"num":"4","place":"宝山区","act":"46"},{"num":"5","place":"黄浦区","act":"34"},{"num":"6","place":"青浦区","act":"24"},{"num":"7","place":"杨浦区","act":"22"},{"num":"8","place":"徐汇区","act":"22"},{"num":"9","place":"长宁区","act":"19"},{"num":"10","place":"闵行区","act":"14"},{"num":"11","place":"普陀区","act":"13"},{"num":"12","place":"浦东新区","act":"12"},{"num":"13","place":"虹口区","act":"10"},{"num":"14","place":"奉贤区","act":"5"},{"num":"15","place":"松江区","act":"4"},{"num":"16","place":"静安区","act":"0"}]},"mon4":{"zhpm":[{"num":"1","place":"宝山区"},{"num":"2","place":"闵行区"},{"num":"3","place":"黄浦区"},{"num":"4","place":"崇明区"},{"num":"5","place":"徐汇区"},{"num":"6","place":"嘉定区"},{"num":"7","place":"杨浦区"},{"num":"8","place":"长宁区"},{"num":"9","place":"金山区"},{"num":"10","place":"普陀区"},{"num":"11","place":"浦东新区"},{"num":"12","place":"奉贤区"},{"num":"13","place":"虹口区"},{"num":"14","place":"青浦区"},{"num":"15","place":"静安区"},{"num":"16","place":"松江区"}],"hdfbl":[{"num":"1","place":"闵行区","act":"754"},{"num":"2","place":"徐汇区","act":"685"},{"num":"3","place":"崇明区","act":"583"},{"num":"4","place":"宝山区","act":"488"},{"num":"5","place":"静安区","act":"434"},{"num":"6","place":"黄浦区","act":"402"},{"num":"7","place":"长宁区","act":"376"},{"num":"8","place":"奉贤区","act":"359"},{"num":"9","place":"金山区","act":"325"},{"num":"10","place":"浦东新区","act":"305"},{"num":"11","place":"嘉定区","act":"216"},{"num":"12","place":"杨浦区","act":"179"},{"num":"13","place":"普陀区","act":"165"},{"num":"14","place":"虹口区","act":"163"},{"num":"15","place":"青浦区","act":"159"},{"num":"16","place":"松江区","act":"135"}],"kyyhd":[{"num":"1","place":"宝山区","act":"402"},{"num":"2","place":"黄浦区","act":"282"},{"num":"3","place":"闵行区","act":"250"},{"num":"4","place":"嘉定区","act":"168"},{"num":"5","place":"徐汇区","act":"108"},{"num":"6","place":"杨浦区","act":"98"},{"num":"7","place":"崇明区","act":"85"},{"num":"8","place":"浦东新区","act":"70"},{"num":"9","place":"普陀区","act":"66"},{"num":"10","place":"长宁区","act":"36"},{"num":"11","place":"松江区","act":"25"},{"num":"12","place":"虹口区","act":"23"},{"num":"13","place":"青浦区","act":"15"},{"num":"14","place":"奉贤区","act":"12"},{"num":"15","place":"金山区","act":"8"},{"num":"16","place":"静安区","act":"0"}],"gjfbl":[{"num":"1","place":"闵行区","act":"44.35"},{"num":"2","place":"徐汇区","act":"42.81"},{"num":"3","place":"宝山区","act":"37.54"},{"num":"4","place":"崇明区","act":"26.50"},{"num":"5","place":"奉贤区","act":"23.93"},{"num":"6","place":"长宁区","act":"23.50"},{"num":"7","place":"黄浦区","act":"22.33"},{"num":"8","place":"静安区","act":"20.67"},{"num":"9","place":"金山区","act":"20.31"},{"num":"10","place":"虹口区","act":"13.58"},{"num":"11","place":"杨浦区","act":"11.93"},{"num":"12","place":"嘉定区","act":"11.37"},{"num":"13","place":"青浦区","act":"11.36"},{"num":"14","place":"普陀区","act":"9.71"},{"num":"15","place":"浦东新区","act":"7.09"},{"num":"16","place":"松江区","act":"6.14"}],"gjyyl":[{"num":"1","place":"宝山区","act":"82.38%"},{"num":"2","place":"嘉定区","act":"77.78%"},{"num":"3","place":"黄浦区","act":"70.15%"},{"num":"4","place":"杨浦区","act":"54.75%"},{"num":"5","place":"普陀区","act":"40.00%"},{"num":"6","place":"闵行区","act":"33.16%"},{"num":"7","place":"浦东新区","act":"22.95%"},{"num":"8","place":"松江区","act":"18.52%"},{"num":"9","place":"徐汇区","act":"15.77%"},{"num":"10","place":"崇明区","act":"14.58%"},{"num":"11","place":"虹口区","act":"14.11%"},{"num":"12","place":"长宁区","act":"9.57%"},{"num":"13","place":"青浦区","act":"9.43%"},{"num":"14","place":"奉贤区","act":"3.34%"},{"num":"15","place":"金山区","act":"2.46%"},{"num":"16","place":"静安区","act":"0.00%"}],"hdskyyl":[{"num":"1","place":"崇明区","act":"142"},{"num":"2","place":"嘉定区","act":"125"},{"num":"3","place":"金山区","act":"57"},{"num":"4","place":"宝山区","act":"46"},{"num":"5","place":"黄浦区","act":"34"},{"num":"6","place":"青浦区","act":"24"},{"num":"7","place":"杨浦区","act":"22"},{"num":"8","place":"徐汇区","act":"22"},{"num":"9","place":"长宁区","act":"19"},{"num":"10","place":"闵行区","act":"14"},{"num":"11","place":"普陀区","act":"13"},{"num":"12","place":"浦东新区","act":"12"},{"num":"13","place":"虹口区","act":"10"},{"num":"14","place":"奉贤区","act":"5"},{"num":"15","place":"松江区","act":"4"},{"num":"16","place":"静安区","act":"0"}]},"mon3":{"zhpm":[{"num":"1","place":"宝山区"},{"num":"2","place":"闵行区"},{"num":"3","place":"徐汇区"},{"num":"4","place":"崇明区"},{"num":"5","place":"黄浦区"},{"num":"6","place":"嘉定区"},{"num":"7","place":"长宁区"},{"num":"8","place":"杨浦区"},{"num":"9","place":"普陀区"},{"num":"10","place":"浦东新区"},{"num":"11","place":"奉贤区"},{"num":"12","place":"金山区"},{"num":"13","place":"静安区"},{"num":"14","place":"青浦区"},{"num":"15","place":"虹口区"},{"num":"16","place":"松江区"}],"hdfbl":[{"num":"1","place":"闵行区","act":"778"},{"num":"2","place":"徐汇区","act":"667"},{"num":"3","place":"崇明区","act":"583"},{"num":"4","place":"宝山区","act":"556"},{"num":"5","place":"静安区","act":"531"},{"num":"6","place":"长宁区","act":"500"},{"num":"7","place":"浦东新区","act":"418"},{"num":"8","place":"黄浦区","act":"341"},{"num":"9","place":"奉贤区","act":"337"},{"num":"10","place":"金山区","act":"237"},{"num":"11","place":"普陀区","act":"232"},{"num":"12","place":"嘉定区","act":"229"},{"num":"13","place":"杨浦区","act":"192"},{"num":"14","place":"虹口区","act":"153"},{"num":"15","place":"青浦区","act":"146"},{"num":"16","place":"松江区","act":"135"}],"kyyhd":[{"num":"1","place":"宝山区","act":"424"},{"num":"2","place":"闵行区","act":"235"},{"num":"3","place":"黄浦区","act":"234"},{"num":"4","place":"嘉定区","act":"187"},{"num":"5","place":"徐汇区","act":"175"},{"num":"6","place":"杨浦区","act":"117"},{"num":"7","place":"崇明区","act":"101"},{"num":"8","place":"浦东新区","act":"99"},{"num":"9","place":"普陀区","act":"76"},{"num":"10","place":"长宁区","act":"58"},{"num":"11","place":"奉贤区","act":"42"},{"num":"12","place":"松江区","act":"26"},{"num":"13","place":"虹口区","act":"26"},{"num":"14","place":"青浦区","act":"7"},{"num":"15","place":"金山区","act":"2"},{"num":"16","place":"静安区","act":"0"}],"gjfbl":[{"num":"1","place":"闵行区","act":"45.76"},{"num":"2","place":"徐汇区","act":"41.69"},{"num":"3","place":"宝山区","act":"37.07"},{"num":"4","place":"长宁区","act":"31.25"},{"num":"5","place":"崇明区","act":"26.50"},{"num":"6","place":"静安区","act":"25.29"},{"num":"7","place":"奉贤区","act":"22.47"},{"num":"8","place":"黄浦区","act":"18.94"},{"num":"9","place":"嘉定区","act":"15.27"},{"num":"10","place":"金山区","act":"14.81"},{"num":"11","place":"普陀区","act":"13.65"},{"num":"12","place":"杨浦区","act":"12.80"},{"num":"13","place":"虹口区","act":"12.75"},{"num":"14","place":"青浦区","act":"10.43"},{"num":"15","place":"浦东新区","act":"9.72"},{"num":"16","place":"松江区","act":"6.14"}],"gjyyl":[{"num":"1","place":"嘉定区","act":"81.66%"},{"num":"2","place":"宝山区","act":"76.26%"},{"num":"3","place":"黄浦区","act":"68.62%"},{"num":"4","place":"杨浦区","act":"60.96%"},{"num":"5","place":"普陀区","act":"32.76%"},{"num":"6","place":"闵行区","act":"30.21%"},{"num":"7","place":"徐汇区","act":"26.24%"},{"num":"8","place":"浦东新区","act":"23.68%"},{"num":"9","place":"松江区","act":"19.26%"},{"num":"10","place":"崇明区","act":"17.32%"},{"num":"11","place":"虹口区","act":"16.99%"},{"num":"12","place":"奉贤区","act":"12.46%"},{"num":"13","place":"长宁区","act":"11.60%"},{"num":"14","place":"青浦区","act":"4.79%"},{"num":"15","place":"金山区","act":"0.84%"},{"num":"16","place":"静安区","act":"0.00%"}],"hdskyyl":[{"num":"1","place":"崇明区","act":"142"},{"num":"2","place":"嘉定区","act":"125"},{"num":"3","place":"金山区","act":"48"},{"num":"4","place":"宝山区","act":"45"},{"num":"5","place":"黄浦区","act":"32"},{"num":"6","place":"青浦区","act":"24"},{"num":"7","place":"徐汇区","act":"22"},{"num":"8","place":"闵行区","act":"21"},{"num":"9","place":"长宁区","act":"19"},{"num":"10","place":"杨浦区","act":"14"},{"num":"11","place":"普陀区","act":"12"},{"num":"12","place":"浦东新区","act":"12"},{"num":"13","place":"奉贤区","act":"5"},{"num":"14","place":"松江区","act":"4"},{"num":"15","place":"虹口区","act":"2"},{"num":"16","place":"静安区","act":"0"}]},"mon2":{"zhpm":[{"num":"1","place":"宝山区"},{"num":"2","place":"崇明区"},{"num":"3","place":"黄浦区"},{"num":"4","place":"嘉定区"},{"num":"5","place":"闵行区"},{"num":"6","place":"徐汇区"},{"num":"7","place":"长宁区"},{"num":"8","place":"杨浦区"},{"num":"9","place":"浦东新区"},{"num":"10","place":"奉贤区"},{"num":"11","place":"普陀区"},{"num":"12","place":"静安区"},{"num":"13","place":"金山区"},{"num":"14","place":"虹口区"},{"num":"15","place":"青浦区"},{"num":"16","place":"松江区"}],"hdfbl":[{"num":"1","place":"静安区","act":"543"},{"num":"2","place":"宝山区","act":"470"},{"num":"3","place":"崇明区","act":"433"},{"num":"4","place":"闵行区","act":"408"},{"num":"5","place":"长宁区","act":"311"},{"num":"6","place":"浦东新区","act":"288"},{"num":"7","place":"奉贤区","act":"270"},{"num":"8","place":"徐汇区","act":"258"},{"num":"9","place":"黄浦区","act":"251"},{"num":"10","place":"金山区","act":"187"},{"num":"11","place":"普陀区","act":"185"},{"num":"12","place":"嘉定区","act":"172"},{"num":"13","place":"杨浦区","act":"160"},{"num":"14","place":"青浦区","act":"106"},{"num":"15","place":"虹口区","act":"89"},{"num":"16","place":"松江区","act":"78"}],"kyyhd":[{"num":"1","place":"宝山区","act":"332"},{"num":"2","place":"黄浦区","act":"195"},{"num":"3","place":"金山区","act":"124"},{"num":"4","place":"嘉定区","act":"124"},{"num":"5","place":"徐汇区","act":"88"},{"num":"6","place":"崇明区","act":"85"},{"num":"7","place":"闵行区","act":"84"},{"num":"8","place":"杨浦区","act":"79"},{"num":"9","place":"浦东新区","act":"66"},{"num":"10","place":"普陀区","act":"57"},{"num":"11","place":"奉贤区","act":"46"},{"num":"12","place":"长宁区","act":"42"},{"num":"13","place":"虹口区","act":"15"},{"num":"14","place":"松江区","act":"12"},{"num":"15","place":"青浦区","act":"5"},{"num":"16","place":"静安区","act":"0"}],"gjfbl":[{"num":"1","place":"宝山区","act":"31.33"},{"num":"2","place":"静安区","act":"25.86"},{"num":"3","place":"闵行区","act":"24.00"},{"num":"4","place":"崇明区","act":"19.68"},{"num":"5","place":"长宁区","act":"19.44"},{"num":"6","place":"奉贤区","act":"18.00"},{"num":"7","place":"徐汇区","act":"16.13"},{"num":"8","place":"黄浦区","act":"13.94"},{"num":"9","place":"金山区","act":"11.69"},{"num":"10","place":"嘉定区","act":"11.47"},{"num":"11","place":"普陀区","act":"10.88"},{"num":"12","place":"杨浦区","act":"10.67"},{"num":"13","place":"青浦区","act":"7.57"},{"num":"14","place":"虹口区","act":"7.42"},{"num":"15","place":"浦东新区","act":"6.70"},{"num":"16","place":"松江区","act":"3.55"}],"gjyyl":[{"num":"1","place":"黄浦区","act":"77.69%"},{"num":"2","place":"嘉定区","act":"72.09%"},{"num":"3","place":"宝山区","act":"70.64%"},{"num":"4","place":"金山区","act":"66.31%"},{"num":"5","place":"杨浦区","act":"49.38%"},{"num":"6","place":"徐汇区","act":"34.11%"},{"num":"7","place":"普陀区","act":"30.81%"},{"num":"8","place":"浦东新区","act":"22.92%"},{"num":"9","place":"闵行区","act":"20.59%"},{"num":"10","place":"崇明区","act":"19.63%"},{"num":"11","place":"奉贤区","act":"17.04%"},{"num":"12","place":"虹口区","act":"16.85%"},{"num":"13","place":"松江区","act":"15.38%"},{"num":"14","place":"长宁区","act":"13.50%"},{"num":"15","place":"青浦区","act":"4.72%"},{"num":"16","place":"静安区","act":"0.0%"}],"hdskyyl":[{"num":"1","place":"崇明区","act":"142"},{"num":"2","place":"嘉定区","act":"125"},{"num":"3","place":"金山区","act":"48"},{"num":"4","place":"宝山区","act":"45"},{"num":"5","place":"黄浦区","act":"32"},{"num":"6","place":"青浦区","act":"24"},{"num":"7","place":"徐汇区","act":"22"},{"num":"8","place":"闵行区","act":"21"},{"num":"9","place":"长宁区","act":"19"},{"num":"10","place":"杨浦区","act":"14"},{"num":"11","place":"普陀区","act":"12"},{"num":"12","place":"浦东新区","act":"12"},{"num":"13","place":"奉贤区","act":"5"},{"num":"14","place":"松江区","act":"4"},{"num":"15","place":"虹口区","act":"2"},{"num":"16","place":"静安区","act":"0"}]},"mon1":{"zhpm":[{"num":"1","place":"宝山区"},{"num":"2","place":"崇明区"},{"num":"3","place":"闵行区"},{"num":"4","place":"黄浦区"},{"num":"5","place":"徐汇区"},{"num":"6","place":"长宁区"},{"num":"7","place":"嘉定区"},{"num":"8","place":"静安区"},{"num":"9","place":"普陀区"},{"num":"10","place":"杨浦区"},{"num":"11","place":"浦东新区"},{"num":"12","place":"奉贤区"},{"num":"13","place":"金山区"},{"num":"14","place":"虹口区"},{"num":"15","place":"青浦区"},{"num":"16","place":"松江区"}],"hdfbl":[{"num":"1","place":"静安区","act":"593"},{"num":"2","place":"长宁区","act":"466"},{"num":"3","place":"宝山区","act":"380"},{"num":"4","place":"崇明区","act":"373"},{"num":"5","place":"闵行区","act":"359"},{"num":"6","place":"浦东新区","act":"302"},{"num":"7","place":"普陀区","act":"297"},{"num":"8","place":"奉贤区","act":"237"},{"num":"9","place":"徐汇区","act":"231"},{"num":"10","place":"黄浦区","act":"192"},{"num":"11","place":"金山区","act":"185"},{"num":"12","place":"杨浦区","act":"169"},{"num":"13","place":"嘉定区","act":"151"},{"num":"14","place":"虹口区","act":"86"},{"num":"15","place":"青浦区","act":"82"},{"num":"16","place":"松江区","act":"79"}],"kyyhd":[{"num":"1","place":"宝山区","act":"243"},{"num":"2","place":"黄浦区","act":"167"},{"num":"3","place":"嘉定区","act":"110"},{"num":"4","place":"闵行区","act":"101"},{"num":"5","place":"崇明区","act":"97"},{"num":"6","place":"徐汇区","act":"76"},{"num":"7","place":"浦东新区","act":"74"},{"num":"8","place":"杨浦区","act":"73"},{"num":"9","place":"长宁区","act":"66"},{"num":"10","place":"普陀区","act":"55"},{"num":"11","place":"奉贤区","act":"40"},{"num":"12","place":"虹口区","act":"14"},{"num":"13","place":"金山区","act":"11"},{"num":"14","place":"松江区","act":"10"},{"num":"15","place":"青浦区","act":"6"},{"num":"16","place":"静安区","act":"0"}],"gjfbl":[{"num":"1","place":"长宁区","act":"29.13"},{"num":"2","place":"静安区","act":"28.24"},{"num":"3","place":"宝山区","act":"25.33"},{"num":"4","place":"闵行区","act":"21.12"},{"num":"5","place":"普陀区","act":"17.47"},{"num":"6","place":"崇明区","act":"16.95"},{"num":"7","place":"奉贤区","act":"15.80"},{"num":"8","place":"徐汇区","act":"14.44"},{"num":"9","place":"金山区","act":"11.56"},{"num":"10","place":"杨浦区","act":"11.27"},{"num":"11","place":"黄浦区","act":"10.67"},{"num":"12","place":"嘉定区","act":"10.07"},{"num":"13","place":"虹口区","act":"7.17"},{"num":"14","place":"浦东新区","act":"7.02"},{"num":"15","place":"青浦区","act":"5.86"},{"num":"16","place":"松江区","act":"3.59"}],"gjyyl":[{"num":"1","place":"黄浦区","act":"86.98%"},{"num":"2","place":"嘉定区","act":"72.85%"},{"num":"3","place":"宝山区","act":"63.95%"},{"num":"4","place":"杨浦区","act":"43.20%"},{"num":"5","place":"徐汇区","act":"32.90%"},{"num":"6","place":"闵行区","act":"28.13%"},{"num":"7","place":"崇明区","act":"26.01%"},{"num":"8","place":"浦东新区","act":"24.50%"},{"num":"9","place":"普陀区","act":"18.52%"},{"num":"10","place":"奉贤区","act":"16.88%"},{"num":"11","place":"虹口区","act":"16.28%"},{"num":"12","place":"长宁区","act":"14.16%"},{"num":"13","place":"松江区","act":"12.66%"},{"num":"14","place":"青浦区","act":"7.32%"},{"num":"15","place":"金山区","act":"5.95%"},{"num":"16","place":"静安区","act":"0.0%"}],"hdskyyl":[{"num":"1","place":"崇明区","act":"142"},{"num":"2","place":"嘉定区","act":"125"},{"num":"3","place":"金山区","act":"48"},{"num":"4","place":"宝山区","act":"45"},{"num":"5","place":"黄浦区","act":"32"},{"num":"6","place":"青浦区","act":"24"},{"num":"7","place":"徐汇区","act":"22"},{"num":"8","place":"闵行区","act":"21"},{"num":"9","place":"长宁区","act":"19"},{"num":"10","place":"杨浦区","act":"14"},{"num":"11","place":"普陀区","act":"12"},{"num":"12","place":"浦东新区","act":"12"},{"num":"13","place":"奉贤区","act":"5"},{"num":"14","place":"松江区","act":"4"},{"num":"15","place":"虹口区","act":"2"},{"num":"16","place":"静安区","act":"0"}]},"all":{"zhpm":[{"num":"1","place":"嘉定区"},{"num":"2","place":"黄浦区"},{"num":"3","place":"徐汇区"},{"num":"4","place":"宝山区"},{"num":"5","place":"金山区"},{"num":"6","place":"长宁区"},{"num":"7","place":"崇明区"},{"num":"8","place":"闵行区"},{"num":"9","place":"浦东新区"},{"num":"10","place":"静安区"},{"num":"11","place":"松江区"},{"num":"12","place":"奉贤区"},{"num":"13","place":"杨浦区"},{"num":"14","place":"虹口区"},{"num":"15","place":"普陀区"},{"num":"16","place":"青浦区"}],"hdfbl":[{"num":"1","place":"闵行区","act":"7758"},{"num":"2","place":"静安区","act":"5891"},{"num":"3","place":"徐汇区","act":"5635"},{"num":"4","place":"黄浦区","act":"5590"},{"num":"5","place":"崇明区","act":"5548"},{"num":"6","place":"宝山区","act":"5330"},{"num":"7","place":"金山区","act":"5029"},{"num":"8","place":"长宁区","act":"4825"},{"num":"9","place":"浦东新区","act":"4575"},{"num":"10","place":"奉贤区","act":"2629"},{"num":"11","place":"嘉定区","act":"2248"},{"num":"12","place":"普陀区","act":"2022"},{"num":"13","place":"杨浦区","act":"1664"},{"num":"14","place":"虹口区","act":"1620"},{"num":"15","place":"青浦区","act":"1404"},{"num":"16","place":"松江区","act":"1350"}],"kyyhd":[{"num":"1","place":"宝山区","act":"4159"},{"num":"2","place":"黄浦区","act":"3996"},{"num":"3","place":"徐汇区","act":"2967"},{"num":"4","place":"闵行区","act":"2352"},{"num":"5","place":"嘉定区","act":"1793"},{"num":"6","place":"崇明区","act":"1305"},{"num":"7","place":"杨浦区","act":"925"},{"num":"8","place":"浦东新区","act":"770"},{"num":"9","place":"普陀区","act":"712"},{"num":"10","place":"奉贤区","act":"350"},{"num":"11","place":"长宁区","act":"322"},{"num":"12","place":"虹口区","act":"283"},{"num":"13","place":"静安区","act":"226"},{"num":"14","place":"松江区","act":"204"},{"num":"15","place":"金山区","act":"108"},{"num":"16","place":"青浦区","act":"45"}],"gjfbl":[{"num":"1","place":"闵行区","act":"431.00"},{"num":"2","place":"徐汇区","act":"352.19"},{"num":"3","place":"金山区","act":"314.31"},{"num":"4","place":"宝山区","act":"313.53"},{"num":"5","place":"黄浦区","act":"310.56"},{"num":"6","place":"长宁区","act":"301.56"},{"num":"7","place":"静安区","act":"280.52"},{"num":"8","place":"崇明区","act":"252.18"},{"num":"9","place":"奉贤区","act":"175.27"},{"num":"10","place":"嘉定区","act":"149.87"},{"num":"11","place":"虹口区","act":"135.00"},{"num":"12","place":"普陀区","act":"118.94"},{"num":"13","place":"杨浦区","act":"110.93"},{"num":"14","place":"浦东新区","act":"106.40"},{"num":"15","place":"青浦区","act":"100.29"},{"num":"16","place":"松江区","act":"61.36"}],"gjyyl":[{"num":"1","place":"松江区","act":"83.8%"},{"num":"2","place":"嘉定区","act":"81.5%"},{"num":"3","place":"金山区","act":"73.0%"},{"num":"4","place":"静安区","act":"58.3%"},{"num":"5","place":"长宁区","act":"41.4%"},{"num":"6","place":"黄浦区","act":"27.8%"},{"num":"7","place":"虹口区","act":"22.8%"},{"num":"8","place":"徐汇区","act":"12.5%"},{"num":"9","place":"浦东新区","act":"11.0%"},{"num":"10","place":"崇明区","act":"5.8%"},{"num":"11","place":"杨浦区","act":"5.8%"},{"num":"12","place":"普陀区","act":"5.6%"},{"num":"13","place":"宝山区","act":"4.2%"},{"num":"14","place":"闵行区","act":"1.0%"},{"num":"15","place":"奉贤区","act":"1.0%"},{"num":"16","place":"青浦区","act":"0.1%"}],"hdskyyl":[{"num":"1","place":"崇明区","act":"142"},{"num":"2","place":"嘉定区","act":"130"},{"num":"3","place":"宝山区","act":"79"},{"num":"4","place":"奉贤区","act":"78"},{"num":"5","place":"黄浦区","act":"67"},{"num":"6","place":"金山区","act":"60"},{"num":"7","place":"徐汇区","act":"43"},{"num":"8","place":"青浦区","act":"36"},{"num":"9","place":"浦东新区","act":"31"},{"num":"10","place":"杨浦区","act":"22"},{"num":"11","place":"长宁区","act":"19"},{"num":"12","place":"普陀区","act":"16"},{"num":"13","place":"闵行区","act":"16"},{"num":"14","place":"虹口区","act":"11"},{"num":"15","place":"松江区","act":"10"},{"num":"16","place":"静安区","act":"1"}]}};



function assessData(){
	
	var mon = areaName(areaPlaceNum)
	
	//清空数据
	$("#assessMon").html('')
	$("#zhpm").html('');
	$("#hdfbl").html('');
	$("#kyyhd").html('');
	$("#gjfbl").html('');
	$("#gjyyl").html('');
	$("#hdskyyl").html('');
	if(mon == 0){
		var _mon = "all";
		$("#assessMon").html("2017年全年")
	}else{
		var _mon = "mon" + mon;
		$("#assessMon").html("2017年<span>" + mon + "</span>月")
	}
	
	
	
	//对比上月	
	var _prev = "mon" + (mon-1);
	
	//综合排名	
	$.each(assess[_mon].zhpm,function(index){
		
		if(mon == 0 || mon == 1){
			var _type = 'center';	
		}else{
			for(var i = 0; i < assess[_prev].zhpm.length; i++){
				if(this.place == assess[_prev].zhpm[i].place){
					var _type = '';
					if(index > i){
						_type = 'down';
					}else if(index == i){
						_type = 'center';
					}else{
						_type = 'up';
					}
				}
			}
		}
		
		$("#zhpm").append(
				"<li class='clearfix'>"+
					"<div>" + this.num + "</div>"+
					"<div>" + this.place + "</div>"+
					"<div><img src='img/" + _type + ".png'></div>"+
				"</li>"
				)
	})
	
	//活动发布量	
	$.each(assess[_mon].hdfbl,function(index){
		
		if(mon == 0 || mon == 1){
			var _type = 'center';	
		}else{
			for(var i = 0; i < assess[_prev].zhpm.length; i++){
				if(this.place == assess[_prev].zhpm[i].place){
					var _type = '';
					if(index > i){
						_type = 'down';
					}else if(index == i){
						_type = 'center';
					}else{
						_type = 'up';
					}
				}
			}
		}
		
		$("#hdfbl").append(
				"<li class='clearfix'>"+
					"<div>" + this.num + "</div>"+
					"<div>" + this.place + "</div>"+
					"<div>" + this.act + "</div>"+
					"<div><img src='img/" + _type + ".png'></div>"+
				"</li>"
				)
	})
	
	//活动发布量	
	$.each(assess[_mon].kyyhd,function(index){
		
		if(mon == 0 || mon == 1){
			var _type = 'center';	
		}else{
			for(var i = 0; i < assess[_prev].zhpm.length; i++){
				if(this.place == assess[_prev].zhpm[i].place){
					var _type = '';
					if(index > i){
						_type = 'down';
					}else if(index == i){
						_type = 'center';
					}else{
						_type = 'up';
					}
				}
			}
		}
		
		$("#kyyhd").append(
				"<li class='clearfix'>"+
					"<div>" + this.num + "</div>"+
					"<div>" + this.place + "</div>"+
					"<div>" + this.act + "</div>"+
					"<div><img src='img/" + _type + ".png'></div>"+
				"</li>"
				)
	})
	
	
	
	//计算百分比
	var gjfblScale = [];
	$.each(assess[_mon].gjfbl,function(index){
		gjfblScale.push(this.act);
	})
	var gjfblMax = Math.max.apply(null,gjfblScale);
	
	//馆均发布量	
	$.each(assess[_mon].gjfbl,function(index){
		
		if(mon == 0 || mon == 1){
			var _type = 'center';	
		}else{
			for(var i = 0; i < assess[_prev].zhpm.length; i++){
				if(this.place == assess[_prev].zhpm[i].place){
					var _type = '';
					if(index > i){
						_type = 'down';
					}else if(index == i){
						_type = 'center';
					}else{
						_type = 'up';
					}
				}
			}
		}
		
		var point = this.act / gjfblMax * 100;
		point += "%"
		
		$("#gjfbl").append(
				"<li class='clearfix'>"+
					"<div>" + this.num + "</div>"+
					"<div>" + this.place + "</div>"+
					"<div>"+
						"<em style='width:" + point + ";'></em>"+
					"</div>"+
					"<div>" + this.act + "</div>"+
					"<div><img src='img/" + _type + ".png'></div>"+
				"</li>"
				)
	})
	
	
	//馆均预约率	
	$.each(assess[_mon].gjyyl,function(index){
		
		if(mon == 0 || mon == 1){
			var _type = 'center';	
		}else{
			for(var i = 0; i < assess[_prev].zhpm.length; i++){
				if(this.place == assess[_prev].zhpm[i].place){
					var _type = '';
					if(index > i){
						_type = 'down';
					}else if(index == i){
						_type = 'center';
					}else{
						_type = 'up';
					}
				}
			}
		}
		
		$("#gjyyl").append(
				"<li class='clearfix'>"+
					"<div>" + this.num + "</div>"+
					"<div>" + this.place + "</div>"+
					"<div>"+
						"<em style='width:" + this.act + ";'></em>"+
					"</div>"+
					"<div>" + this.act + "</div>"+
					"<div><img src='img/" + _type + ".png'></div>"+
				"</li>"
				)
	})
	
	
	
	
	//计算百分比
	var hdskyylScale = [];
	$.each(assess[_mon].hdskyyl,function(index){
		hdskyylScale.push(this.act);
	})
	var hdskyylMax = Math.max.apply(null,hdskyylScale);
	
	//馆均发布量	
	$.each(assess[_mon].hdskyyl,function(index){
		
		if(mon == 0 || mon == 1){
			var _type = 'center';	
		}else{
			for(var i = 0; i < assess[_prev].zhpm.length; i++){
				if(this.place == assess[_prev].zhpm[i].place){
					var _type = '';
					if(index > i){
						_type = 'down';
					}else if(index == i){
						_type = 'center';
					}else{
						_type = 'up';
					}
				}
			}
		}
		
		var point = this.act / hdskyylMax * 100;
		point += "%"
		
		$("#hdskyyl").append(
				"<li class='clearfix'>"+
					"<div>" + this.num + "</div>"+
					"<div>" + this.place + "</div>"+
					"<div>"+
						"<em style='width:" + point + ";'></em>"+
					"</div>"+
					"<div>" + this.act + "</div>"+
					"<div><img src='img/" + _type + ".png'></div>"+
				"</li>"
				)
	})
	
	
	
	
	
}








//清除数据
function clearData(){
	$(".areaBookingChart").children().remove()
	$('.mainCoverSJ').hide();
	$('.mainCoverLY').hide();
	$('.mainCoverJD').hide();
	$('.mainCoverVenue').hide();
	$("#assessData").hide();
	$(".assessDiv").hide()
	drawclear();
}








function test(){
	
	$("#bigDataTitle").text(areaName(areaPlaceNum))
	
	$.get('getdata.jsp?uid=16', function (data)
			{//区县用户分布
				/*var jsondatat = parseJson(data);
				var total = jsondatat["total"];
				if(typeof total != "undefined" && total.length > 0)
				{
					for(var i=0;i<total.length;i++)
					{
						var area = total[i]["area"];
						if(area == areaName(areaPlaceNum))
						{
							
							var male = total[i]["male"];
							var female = total[i]["female"];
							var total = male + female;
							if(total == 0)
							{
								return;
							}
							var malerate = Math.floor(male / (male + female) * 100);
							var femalerate = 100 - malerate;
							$("#areaMaleRate").html(malerate);
							$("#areaFemaleRate").html(femalerate);
							return;

						}
					}
				}*/
		if(areaName(areaPlaceNum) == "黄浦"){
			$("#areaMaleRate").html("48");
			$("#areaFemaleRate").html("52");
			}
		
		else if(areaName(areaPlaceNum) == "徐汇"){
			$("#areaMaleRate").html("44");
			$("#areaFemaleRate").html("56");
			}
		else if(areaName(areaPlaceNum) == "长宁"){
			$("#areaMaleRate").html("38");
			$("#areaFemaleRate").html("62");
		}
		else if(areaName(areaPlaceNum) == "崇明"){
			$("#areaMaleRate").html("45");
			$("#areaFemaleRate").html("55");
		}
		else if(areaName(areaPlaceNum) == "普陀"){
			$("#areaMaleRate").html("49");
			$("#areaFemaleRate").html("51");
		}
		else if(areaName(areaPlaceNum) == "金山"){
			$("#areaMaleRate").html("44");
			$("#areaFemaleRate").html("56");
		}
		else if(areaName(areaPlaceNum) == "杨浦"){
			$("#areaMaleRate").html("43");
			$("#areaFemaleRate").html("57");
		}
		else if(areaName(areaPlaceNum) == "闵行"){
			$("#areaMaleRate").html("51");
			$("#areaFemaleRate").html("49");
		}
		else if(areaName(areaPlaceNum) == "宝山"){
			$("#areaMaleRate").html("43");
			$("#areaFemaleRate").html("57");
		}
		else if(areaName(areaPlaceNum) == "浦东"){
			$("#areaMaleRate").html("49");
			$("#areaFemaleRate").html("51");
		}
		else if(areaName(areaPlaceNum) == "奉贤"){
			$("#areaMaleRate").html("50");
			$("#areaFemaleRate").html("50");
		}
		else if(areaName(areaPlaceNum) == "松江"){
			$("#areaMaleRate").html("44");
			$("#areaFemaleRate").html("56");
		}
	});
			
	$.get('getdata.jsp?uid=18', function (data)
			{//区县用户兴趣标签分布
				var jsondatat = parseJson(data);
				var total = jsondatat["total"];
				if(typeof total != "undefined" && total.length > 0)
				{
					for(var i=0;i<total.length;i++)
					{
						var area = total[i]["area"];
						if(area == areaName(areaPlaceNum))
						{
							var zhanlan = total[i]["zhanlan"];
							var dianying = total[i]["dianying"];
							var jiangzuo = total[i]["jiangzuo"];
							var yanchu = total[i]["yanchu"];

							var total = zhanlan + dianying + jiangzuo + yanchu;
							if(total == 0)
							{
								return;
							}
							var zhanlanrate = Math.floor(zhanlan / total * 100);
							var dianyingrate = Math.floor(dianying / total * 100);
							var jiangzuorate = Math.floor(jiangzuo / total * 100);
							var yanchurate = 100 -  zhanlanrate - dianyingrate - jiangzuorate;
							$("#areaMovieTag").html(dianyingrate);
							$("#areaPlayTag").html(yanchurate);
							$("#areaSpeechTag").html(jiangzuorate);
							$("#areaExhibtionTag").html(zhanlanrate);
							return;

						}
					}
				}
			}
	);
	
	
	$.get('getdata.jsp?uid=15', function (data)
			{//区县活动统计
				var jsondatat = parseJson(data);
				var total = jsondatat["total"];
				if(typeof total != "undefined" && total.length > 0)
				{
					for(var i=0;i<total.length;i++)
					{
						var area = total[i]["area"];
						if(area == areaName(areaPlaceNum))
						{
							$("#areaActivityCount").html(total[i]["actcout"]);
							$("#areaBookingActivityCount").html(total[i]["bookcout"]);
							$("#areaRoomCount").html(total[i]["roomcout"]);
							return;
						}

					}
				}
			})
	
	

	$.get('getdata.jsp?uid=17', function (data)
			{//区县每周订单

				var jsondatat = parseJson(data);
				var total = jsondatat["total"];
				if(typeof total != "undefined" && total.length > 0)
				{
					var dataset = [5,6,3,0.0,0.0,0,0];
					if(areaName(areaPlaceNum)=="黄浦")
						dataset = [1.8,1.5,1.4,0.0,0.0,0,0];
					else if(areaName(areaPlaceNum)=="闵行")
						dataset = [1.1,1.65,1.2,0.0,0.0,0,0];
					else if(areaName(areaPlaceNum)=="长宁")
						dataset = [3,1.2,1.3,1.45,1,0,0];
					else if(areaName(areaPlaceNum)=="徐汇")
						dataset = [1.34,1.23,0.94,0.0,0.0,0,0];
					else if(areaName(areaPlaceNum)=="崇明")
						dataset = [0.98,1.2,1.23,0.0,0.0,0,0];
					else if(areaName(areaPlaceNum)=="宝山")
						dataset = [1.2,1.1,1.6,0.0,0.0,0,0];
					else if(areaName(areaPlaceNum)=="浦东")
						dataset = [1.05,1.45,1.23,0.0,0.0,0,0];
					else if(areaName(areaPlaceNum)=="金山")
						dataset = [0.86,0.98,1.34,0.0,0.0,0,0];
					else if(areaName(areaPlaceNum)=="奉贤")
						dataset = [0.94,1.34,1.07,0.0,0.0,0,0];
					else if(areaName(areaPlaceNum)=="普陀")
						dataset = [1.21,1.54,1.45,0.0,0.0,0,0];
					else if(areaName(areaPlaceNum)=="杨浦")
						dataset = [1.34,1.24,1.68,0.0,0.0,0,0];
					else if(areaName(areaPlaceNum)=="松江")
						dataset = [1.05,1.89,1.34,0.0,0.0,0,0];
					else if(areaName(areaPlaceNum)=="静安")
						dataset = [1.2,1.1,1.6,0.0,0.0,0,0];
					
					
					
					//周一	周二	周三	周四	周五
					//闵行	110	165	120	150	85
					//徐汇	134	123	94	189	87
					//黄浦	184	145	135	124	90
					//崇明	98	120	123	87	60
					//宝山	120	110	160	130	85
					//长宁	300	120	130	145	100
					//浦东	105	145	123	144	94
					//金山	86	98	134	104	75
					//奉贤	94	134	107	111	82
					//普陀	121	154	145	134	96
					//杨浦	134	124	168	189	87
					//松江	105	89	134	120	76
					
					
					
					
					var dataidx = 0;
					/*for(var i=0;i<total.length;i++)
					{
						var area = total[i]["area"];
						if(area == areaName(areaPlaceNum))
						{/////////////
							if(total[i]["ordervote"] > 1000){
								total[i]["ordervote"] = total[i]["ordervote"]/100;
							}else if(total[i]["ordervote"] > 100){
								total[i]["ordervote"] = total[i]["ordervote"]/100;
							}else if(total[i]["ordervote"] > 10){
								total[i]["ordervote"] = total[i]["ordervote"]/10;
							}
							dataset[total[i]["week"] - 1] = total[i]["ordervote"];
						}
					}*/
					//userBookingStatus

					if(dataset.length > 0)
					{
//						var maxvalue = d3.max(dataset);
//						if(maxvalue == 0)
//								maxvalue = 20;
//						else
//								maxvalue += 5;
//						var valueSpan = Math.floor(maxvalue / 1);
						var xMarks=[];
						var w=495;
						var h=400;
						var padding=40;
						d3.select(".userBookingStatus svg").remove()
						var svg=d3.select(".userBookingStatus")
								.append("svg")
								.attr("width",w)
								.attr("height",h)
								.style("fill","none")

						svg.append("g")
								.append("rect")
								.attr("x",0)
								.attr("y",0)
								.attr("width",w)
								.attr("height",h)
						var xScale = d3.scale.linear()
								.domain([0,6])
								.range([padding,w-padding]);

						var xAxis = d3.axisBottom()
								.scale(xScale)
								.ticks(7);
						

						var xBar=svg.append("g")
								.attr("class", "axis")
								.attr("transform", "translate(0," + (h - padding) + ")")
								.call(xAxis)
								.selectAll("text")
								.text(function(d,i){
									if(i == 6)
										return "周日";
									else
										return "周"+(i+1)
								})
								.style("stroke","#7DA0AC")
								.attr("y",15)
								.style("font-size","20px")
								

						var yScale = d3.scale.linear()
								.domain([0,5])
								.range([h-padding,0])							
								

						var yAxis = d3.axisLeft()
								.scale(yScale)
								.ticks(10);

						var yBar=svg.append("g")
								.attr("class", "axis")
								.attr("transform", "translate("+padding+",0)")
								.call(yAxis);


						var line = d3.svg.line()
								.x(function(d,i){return xScale(i);})
								.y(function(d){return yScale(d);});
						var path=svg.append("path")
								.attr("d", line(dataset))
								.style("fill","#F00")
								.style("fill","none")
								.style("stroke-width",1)
								.style("stroke","#FF0")
								.style("stroke-opacity",0.9);
						//添加系列的小圆点
						svg.selectAll("circle")
								.data(dataset)
								.enter()
								.append("circle")
								.attr("cx", function(d,i) {
									return xScale(i);
								})
								.attr("cy", function(d) {
									return yScale(d);
								})
								.attr("r",5)
								.attr("fill", "#FF0");

						$(".domain").attr("stroke","#145C75")
						$(".axis line").attr("stroke","#145C75")
						$(".tick text").attr("fill","#7DA0AC")
					}


				}
			}
	);


	$.get('getdata.jsp?uid=19', function (data)
			{//区县订单票数分布
				var jsondatat = parseJson(data);
				var total = jsondatat["total"];
				if(typeof total != "undefined" && total.length > 0)
				{
					for(var i=0;i<total.length;i++)
					{
						var area = total[i]["activity_area"];
						if(area == areaName(areaPlaceNum))
						{

							var one = total[i]["one"];
							var four = total[i]["four"];
							var five = total[i]["five"];
							var two = total[i]["two"];
							var three = total[i]["three"];
							var total = one + four + five + two +  three;

							var onerate = Math.floor(one/total * 100);
							var fourrate = Math.floor(four/total *  100);
							var fiverate = Math.floor(five/total *  100);
							var tworate = Math.floor(two/total *  100);
							var threerate = 100 - onerate - fourrate  - fiverate - tworate;
							var ary = [["1",one,onerate],["2",two,tworate],["3",three,threerate],["4",four,fourrate],["5",five,fiverate]];
							var arytag = ["first","second","third","fourth","fifth"];
							for(var i=0;i<ary.length;i++)
							{
								var maxidx = 0;
								var max = ary[i][2];
								for(var j=0;j<ary.length;j++)
								{
									if(ary[j][2] >= max)
									{
										max = ary[j][2];
										maxidx = j;
									}

								}
								$("."+arytag[i]+"Vote").html(ary[maxidx][0]+'<em style="font-size: 30px;"> 张</em>');
								$("."+arytag[i]+"VoteRate").html(ary[maxidx][2]+'<em style="font-size: 28px;"> %');
								ary[maxidx][2] = -1;

							}


						}
					}
				}
			}
	);


	$.get('getdata.jsp?uid=20', function (data)
			{//区县活动场馆发布量
				$('.jdzhuzt').children().remove()
				var jsondatat = parseJson(data);
				var total = jsondatat["total"];
				if(typeof total != "undefined" && total.length > 0)
				{
					var ary = [];
					var idx = 0;
					var totalcout = 0;
					for(var i=0;i<total.length;i++)
					{
						var area = total[i]["area"];
						if(area == areaName(areaPlaceNum))
						{
							ary[idx] = [total[i]["venue_name"],total[i]["cout"],0];
							totalcout += total[i]["cout"];
							idx++;
							if(idx >= 13)
							{//最多只显示13条数据
								break;
							}

						}
					}
				}
				if(ary.length > 0)
				{

					var totalrate = 0;
					for (var i = 0; i < ary.length; i++)
					{

						var barfunc = function(e,w,t,r){

							var num = 0;
							var speed = 8;
							var jdTimer = setInterval(function ()
							{
								// num = num + 2 * 1.2;
								num = num + 2;
								if (num <= w)
								{
									e.css({
										'width': num
									});
									e.siblings('em').text(Math.round(num / t * 10000) / 100 + "%");
								} else
								{
									e.css({
										'width':w
									});
									e.siblings('em').text(r.toFixed(2)+"%");
									clearInterval(jdTimer);
								}
							}, speed);
						};
						var zongW = $('.jdzhuzt').width() - 200 ;
						if(ary[i][0].length > 9)
						{
							ary[i][0] = ary[i][0].substring(0,8)+'...';

						}

						$('.jdzhuzt').append('<div class="clearfix" style="top: '+(10 + i* 42 )+'px;"><span style="width:170px;margin-right:10px;">'+ary[i][0]+'</span><span style="background-color: #1e7ca4;left:100px;"></span><em>0%</em></div>');
						var e =  $('.jdzhuzt div:last span:last');
						var rate =  ary[i][1]/totalcout * 100//Math.floor(ary[i][1]/totalcout * 100)
						var _width = Math.floor(rate * zongW / 120);
						if(i == ary.length - 1)
						{
							rate = 100 - totalrate;
						}
						else
						{
							totalrate += rate;
						}
						barfunc(e,_width,zongW,rate);


					}
				}

			}
	);



	$.get('getdata.jsp?uid=21', function (data)
			{//区县场馆预订量
				var jsondatat = parseJson(data);
				var total = jsondatat["total"];
				if(typeof total != "undefined" && total.length > 0)
				{
					var ary = [];
					var dataidx = 0;

					for(var i=0;i<total.length;i++)
					{
						var area = total[i]["area"];
						if(area == areaName(areaPlaceNum))
						{
							ary[dataidx] = [total[i]["venue_name"],total[i]["cout"]]
							dataidx++;
						}
					}

					var width1 = 260,
							height1 = 260,
							radius = Math.min(width1, height1) / 2;

					//var color = d3.scale.ordinal().range(["#EAE680", "#E3B62E", "#5DBDE5", "#81F8FF", "#37BEFE"]);
					var color = d3.scale.ordinal().range(["#E3B62E", "#EAE680", "#81F8FF", "#11F8FF", "#A7BEFE"], "#37BEFE","#53562E", "#7AE650");

					var arc = d3.svg.arc()
							.outerRadius(radius - 10)
							.innerRadius(radius - 40);

					var pie = d3.layout.pie()
							.sort(null)
							.value(function(d) { return d; });

					var svg1 = d3.select(".areaBookingChart")
							.append("svg").attr("class","bookingcircle")
							.attr("width", width1)
							.attr("height", height1)
							.append("g")
							.attr("transform", "translate(" + width1 / 2 + "," + height1 / 2 + ")");
					var areajson = []
					var maxshow = 5;
					for(var i=0;i<ary.length && i<maxshow ;i++)
					{
						areajson[i] = ary[i][1];
					}


					svg1.selectAll(".arc").remove();
					svg1.selectAll(".arc")
							.data(pie(areajson))
							.enter().append("g")
							.attr("class", "arc")
							.append("path")
							.attr("d", arc)
							.style("fill", function(d,i) { return color(i)});

					$(".areaBookingChart").append("<div style='position: absolute;right:100px;top:50px;width:200px;'></div>")
					var e = $(".areaBookingChart div:last")
					for(var i=0;i<ary.length && i<maxshow;i++)
					{
						e.append("<p style='color:"+color(i)+"'>"+ary[i][0]+"</p>");
					}




				}

			}
	);
}


function lineChart(ID,data,func){
	//获取数据
	var dataset = data;	

	var areaName = new Array()
	var week = new Array()
	for(var i = 0; i < dataset.length; i++) {
		areaName.push(dataset[i].x)
		week.push(dataset[i].y)
	}
	console.log(areaName)
	//创建画布
	var svg = d3.select('#' + ID),
		margin = {
			top: 20,
			right: 30,
			bottom: 30,
			left: 70
		},
		width = +svg.attr("width") - margin.left - margin.right,
		height = +svg.attr("height") - margin.top - margin.bottom,
		g = svg.append("g").attr("transform", "translate(" + margin.left + "," + margin.top + ")")
	//创建Y轴
	var y = d3.scaleLinear()
		.rangeRound([height, 0]);
	//Y轴添加点
	y.domain(d3.extent(week, function(d) {
		return d;
	})).nice();
	//画出Y轴
	g.append("g")
		.call(d3.axisLeft(y))
		.style("font-size","15px")
		.append("text")
		.attr("fill", "#000")

	//创建X轴
	var x = d3.scaleLinear()
		.rangeRound([0, width]);
	//X轴添加点
	x.domain(d3.extent(areaName, function(d) {
		return d;
	}));
	//画出X轴
	g.append("g")
		.call(d3.axisBottom(x).ticks(areaName.length))
		//让X轴在下方
		.attr("transform", "translate(0," + height + ")")
		.selectAll("text")
		.text(function(d,i){
			if(func == 'week'){
				if(d == 0){
					return '周一'
				}else if(d == 1){
					return '周二'
				}else if(d == 2){
					return '周三'
				}else if(d == 3){
					return '周四'
				}else if(d == 4){
					return '周五'
				}else if(d == 5){
					return '周六'
				}else if(d == 6){
					return '周日'
				}
			}else if(func == 'month')
			{
				return areaName[i] + '月';
			}else{
				return d;
			}
		})
		.style("font-size","20px")
		.append("text")
		.attr("fill", "#000")
		

	//添加系列的小圆点
	svg.selectAll("circle")
		.data(dataset)
		.enter()
		.append("circle")
		.attr("cx", function(d,index) {
			var num = index+1;
			return x(num) + margin.left;
		})
		.attr("cy", function(d) {
			return y(d.y) + margin.top;
		})
		.attr("r", 5)
		.attr("fill", "#FF0");
	
	//点连成线
	var line = d3.svg.line()
		.x(function(d,index) {
			var num = index+1;
			return x(num)+ margin.left;
		})
		.y(function(d) {
			return y(d.y)+ margin.top;
		});
	var path = svg.append("path")
		.attr("d", line(dataset))
		.style("fill", "#F00")
		.style("fill", "none")
		.style("stroke-width", 1)
		.style("stroke", "#FF0")
		.style("stroke-opacity", 0.9);
}











Date.prototype.Format = function (fmt) { //author: meizz
	var o = {
		"M+": this.getMonth() + 1, //月份
		"d+": this.getDate(), //日
		"h+": this.getHours(), //小时
		"m+": Math.floor(this.getMinutes()/10)*10, //分-取整
		"s+": this.getSeconds(), //秒
		"q+": Math.floor((this.getMonth() + 3) / 3), //季度
		"S": this.getMilliseconds() //毫秒
	};
	if (/(y+)/.test(fmt)) fmt = fmt.replace(RegExp.$1, (this.getFullYear() + "").substr(4 - RegExp.$1.length));
	for (var k in o)
		if (new RegExp("(" + k + ")").test(fmt)) fmt = fmt.replace(RegExp.$1, (RegExp.$1.length == 1) ? (o[k]) : (("00" + o[k]).substr(("" + o[k]).length)));
	return fmt;
}

Date.prototype.Format2 = function (fmt) { //author: meizz
	var o = {
		"M+": this.getMonth() + 1, //月份
		"d+": this.getDate(), //日
		"h+": this.getHours(), //小时
		"m+": this.getMinutes(), //分
		"s+": this.getSeconds(), //秒
		"q+": Math.floor((this.getMonth() + 3) / 3), //季度
		"S": this.getMilliseconds() //毫秒
	};
	if (/(y+)/.test(fmt)) fmt = fmt.replace(RegExp.$1, (this.getFullYear() + "").substr(4 - RegExp.$1.length));
	for (var k in o)
		if (new RegExp("(" + k + ")").test(fmt)) fmt = fmt.replace(RegExp.$1, (RegExp.$1.length == 1) ? (o[k]) : (("00" + o[k]).substr(("" + o[k]).length)));
	return fmt;
}



function page1data()
{//第一页数据
	var uidlist = [1,2,3,4,5,6,7,8];
	for(var idx = 1;idx <= uidlist.length;idx++)
	{
		$.get('getdata.jsp?uid=' + uidlist[idx-1], function (data)
		{

			var url = this.url;
			var uid = url.substr(16);
			if(uid==3)
			{
				new Date();
			}
			var segclass = "#data" + uid;
			var totalclass = "#total" + uid;
			var jsonStr = parseJson(data);
			var total = jsonStr["total"][0]["cout"];//总量
			var timesegment = jsonStr["timesegment"];
			var haveData = (timesegment != '()') && (timesegment != 'None') && (timesegment.length > 0)

			if(haveData) {
				var ctime = new Date().Format("hh:mm");
				if(uid == 2 || uid == 4)
				{//新增用户,访客数不需要累加昨日的数据
					total = 0;
				}
				for (var i = 0; i < timesegment.length; i++) {
					var ts = timesegment[i];
					var gtime = ts["tsresult"].substring(11, 16);
					var value = ts["cout"];
					//只对时间比较，日期忽略
					if (gtime < ctime)
					{//初始值要更新数据到当前时间段
						total += value;
						//比较过的日期从json删除掉
						timesegment.splice(0, 1);
						i--;
					}
					else {
						break;
					}
				}
			}
			if(uid == 2){
				total += 1000;
				var oldDate = jsonStr["total"][0]["cout"] + 1000;
				$(totalclass).text(oldDate);
				$(segclass).text(total);
			}else{
				$(totalclass).text(jsonStr["total"][0]["cout"]);
				$(segclass).text(total);
			}
			
			//时间段间隔为10分钟
			//定时器为1s
			//为了让数据每秒都变化，把10分钟的数据分摊到每秒上
			if(haveData)
			{

				var avgvalue = 0;
				var timer  = setInterval(function ()
				{
					if(timesegment.length > 0)
					{
						var ts = timesegment[0];
						var gtime = ts["tsresult"].substring(11, 16);
						var nowtime = new Date().Format("hh:mm")
						if (gtime == nowtime) {
							avgvalue = ts["cout"] / 600;
							timesegment.splice(0, 1);
						}
						total += avgvalue;
						$(segclass).text(Math.floor(total));
					}

				}, TIME_SPAN_SECOND);
				timerlist[timerlist.length] = timer;
			}


		});
	}
}


function  page2data()
{//第二页数据
	var areajson = [{"area":"嘉定","pos":"top:-90px;left:65px"},{"area":"宝山","pos":"top:-22px;left:165px"},{"area":"青浦","pos":"top:130px;left:-70px"},{"area":"松江","pos":"top:200px;left:-10px"},{"area":"闵行","pos":"top:180px;left:180px"},{"area":"浦东","pos":"top:180px;left:390px"},{"area":"奉贤","pos":"top:315px;left:410px"},{"area":"金山","pos":"top:445px;left:95px"},{"area":"崇明","pos":"top:-220px;left:260px"}];
	var displayOnList = function (timesegment)
	{//列表显示
		if(timesegment.length > 0) {
			$("#map-list-data").empty()
			var ts, gtime, now;
			var idx = timesegment.length - 1;
			var showlength = 10;
			for (; idx >= 0; idx--) {
				if (showlength <= 0) {//最多显示10条数据
					break;
				}
				ts = timesegment[idx];
				gtime = ts["cdate"].substring(11, 16)
				now = new Date().Format2("hh:mm");
				if (gtime > now) {
					continue;
				}
				else {
					var venue = ts["venue_name"];
					var cout = ts["cout"];
					var dh = gtime.substring(0, 2);
					var dm = gtime.substring(3, 5);
					var ch = now.substring(0, 2);
					var cm = now.substring(3, 5);
					var def = 0;
					if (dh == ch) {
						def = (cm - dm + 1) + "分钟前";
					}
					else {
						def = (ch - dh) + "小时前";
					}

					$("#map-list-data").append("<li><p>" + venue + "</p><p>" + cout + "张票</p><p>" + def + "</p><div style=\"clear:both;\"></div></li>");
					showlength--;
				}
			}
		}

	};
	var displayOnMap = function(timesegment)
	{//地图弹出显示
		if(timesegment.length > 0) {
			var ts, gtime;
			while ((ts = timesegment[0], gtime = ts["cdate"].substring(11, 16)) < new Date().Format("hh:mm")) {
				var venue = ts["venue_name"];
				var area = ts["activity_area"].substring(3, 5);
				var cout = ts["cout"];
				var pos = '';
				for (var i = 0; i < areajson.length; i++) {
					if (area == areajson[i]["area"]) {
						pos = areajson[i]["pos"];
					}
				}
				if (pos == '') {
					pos = 'top:15px;left:240px';//默认市区显示位置
				}
				$("#map-bounce-data").append("<button class=\"map-point\" style=\"" + pos + "\"><div class=\"content\"><div class=\"centered-y\"><h2 style=\"color: #24a6cb;font-size: 40;\">" + area + "</h2><p style=\"color: #c29f4a;line-height: 45px;font-size: 30px;\">" + venue + "<br /><span style=\"color: #bedae3;\">预订了</span><span style=\"color: #fcd256;\">" + cout + "</span><span style=\"color: #bedae3;\">张票</span></p></div></div></button>");
				max_pnmu++;
				timesegment.splice(0, 1);

			}
		}
	};




	$.get('getdata.jsp?uid=9', function (data)
	{
		var jsonStr = parseJson(data);
		var timesegment = jsonStr["timesegment"];
		var jsonOrgin =  parseJson(data)["timesegment"];
		displayOnList(jsonOrgin);
		displayOnMap(timesegment);
		var tt = jsonStr["timesegment"];
		var timer = setInterval(function()
			{
				displayOnList(jsonOrgin);
				displayOnMap(timesegment);

			}
			,TIME_SPAN_SECOND);
		timerlist[timerlist.length] = timer;

	});

}

function showUserChannel()
{//用户渠道
	$.get('getdata.jsp?uid=11', function (data)
		{//访问渠道
			var jsonStr = parseJson(data);
			var timesegment = jsonStr["timesegment"];
			var ts,gtime,h5=0,pc=0,android=0,iphone=0;
			if(timesegment.length <= 0)
			{
				return;
			}
			function updateView (svg1,data)
			{
				svg1.selectAll(".arc").remove();
				svg1.selectAll(".arc")
					.data(pie(data))
					.enter().append("g")
					.attr("class", "arc")
					.append("path")
					.attr("d", arc)
					.style("fill", function(d,i) { return color(i)});
					// .append("text")
					// .attr("transform", function(d) {return "translate(" + arc.centroid(d) + ")";})
					// .attr("dy", ".35em")
					// .text(function(d) { return '111'});
			}

			var width1 = 300,
				height1 = 300,
				radius = Math.min(width1, height1) / 2;

			//var color = d3.scale.ordinal().range(["#EAE680", "#E3B62E", "#5DBDE5", "#81F8FF", "#37BEFE"]);
			var color = d3.scale.ordinal().range(["#E3B62E", "#EAE680", "#81F8FF", "#37BEFE"]);

			var arc = d3.svg.arc()
				.outerRadius(radius - 10)
				.innerRadius(radius - 40);

			var pie = d3.layout.pie()
				.sort(null)
				.value(function(d) { return d; });

			var svg1 = d3.select(".main")
				.append("svg").attr("class","qudao")
				.attr("width", width1)
				.attr("height", height1)
				.append("g")
				.attr("transform", "translate(" + width1 / 2 + "," + height1 / 2 + ")");


			while((ts = timesegment[0],gtime=ts["tsresult"].substring(11,16)) < new Date().Format("hh:mm"))
			{
				h5 += ts["h5"];
				pc += ts["pc"];
				android += ts["android"];
				iphone += ts["iphone"];
				timesegment.splice(0, 1);

			}
//				var data = [{"area":0,"pos":10},{"area":1,"pos":20}]
//				//alert(data.slice())
			var areajson = [h5,pc,android,iphone];
			updateView(svg1,areajson);
			var timer = setInterval(function ()
			{
				if(timesegment.length > 0)
				{
					var ts = timesegment[0];
					var gtime = ts["tsresult"].substring(11, 16);
					var nowtime = new Date().Format("hh:mm")
					if (gtime <= nowtime) {
						h5 += ts["h5"];
						pc += ts["pc"];
						android += ts["android"];
						iphone += ts["iphone"];
						areajson = [h5, pc, android, iphone];
						updateView(svg1, areajson);
						timesegment.splice(0, 1);
					}
				}


			}, TIME_SPAN_SECOND);
			timerlist[timerlist.length] = timer;
		}
	);

	// d3.csv("js/data.csv", type, function(error, data) {
	// 	if(error) throw error;
    //
	// 	var g1 = svg1.selectAll(".arc")
	// 		.data(pie(data))
	// 		.enter().append("g")
	// 		.attr("class", "arc");
    //
	// 	g1.append("path")
	// 		.attr("d", arc)
	// 		.style("fill", function(d) { return color(d.data.age); });
    //
	// 	g1.append("text")
	// 		.attr("transform", function(d) {
	// 			return "translate(" + arc.centroid(d) + ")"; }
	// 		)
	// 		.attr("dy", ".35em")
	// 		.text(function(d) { return d.data.age; });
	// });
	// function type(d) {
	// 	d.population = +d.population;
	// 	return d;
	// }


}

function page3data()
{//第三页数据
	showUserChannel();
	showAreaActivity();	
}

function showAreaActivity()
{

	//var arealist = ['黄浦','徐汇','长宁','静安','普陀','闸北','虹口','杨浦','闵行','宝山','嘉定','浦东','金山','松江','青浦','奉贤','崇明'];
	$.get('getdata.jsp?uid=10', function (sdata)
	{//区县活动

		// var jsonStr = parseJson('{"total": [{"cout": 39, "activity_area": "45,上海市", "bookingcout": 10}, {"cout": 9102, "activity_area": "46,黄浦区", "bookingcout": 5771}, {"cout": 9817, "activity_area": "48,徐汇区", "bookingcout": 4038}, {"cout": 10648, "activity_area": "49,长宁区", "bookingcout": 940}, {"cout": 9237, "activity_area": "50,静安区", "bookingcout": 605}, {"cout": 4423, "activity_area": "51,普陀区", "bookingcout": 1521}, {"cout": 6257, "activity_area": "52,闸北区", "bookingcout": 0}, {"cout": 2849, "activity_area": "53,虹口区", "bookingcout": 422}, {"cout": 3677, "activity_area": "54,杨浦区", "bookingcout": 1745}, {"cout": 11000, "activity_area": "55,闵行区", "bookingcout": 2734}, {"cout": 8294, "activity_area": "56,宝山区", "bookingcout": 4997}, {"cout": 2002, "activity_area": "57,嘉定区", "bookingcout": 1219}, {"cout": 8535, "activity_area": "58,浦东新区", "bookingcout": 1694}, {"cout": 7766, "activity_area": "59,金山区", "bookingcout": 255}, {"cout": 2825, "activity_area": "60,松江区", "bookingcout": 422}, {"cout": 2884, "activity_area": "61,青浦区", "bookingcout": 156}, {"cout": 5112, "activity_area": "63,奉贤区", "bookingcout": 649}, {"cout": 9317, "activity_area": "64,崇明区", "bookingcout": 1710}]}');
		var jsonStr = parseJson(sdata);
		var total = jsonStr["total"];

		var data = []
		var keys = ['d1','d2'];//data.columns.slice(1);
		for(var i =1;i<total.length;i++)
		{
			var t = total[i];
			var obj = new Object()
			obj['c'] = t["activity_area"].substring(3,5);
			obj['d1'] = t["bookingcout"];
			obj['d2'] = t["cout"];
			data[i-1] = obj;
		}

		try
		{
			//d3.select("svg").remove();
		}
		catch(err)
		{
		}

		var svg2 = d3.select("#gongyingliang"),
			margin = { top: 20, right: 20, bottom: 30, left: 40 },
			width2 = +svg2.attr("width") - margin.left - margin.right,
			height2 = +svg2.attr("height") - margin.top - margin.bottom,
			g = svg2.append("g").attr("transform", "translate(" + margin.left + "," + margin.top + ")");

		var x0 = d3.scaleBand()
			.rangeRound([0, width2])
			.paddingInner(0.5);

		var x1 = d3.scaleBand()
			.padding(0.05);

		var y = d3.scaleLinear()
			.rangeRound([height2, 0]);

		var z = d3.scaleOrdinal()
			.range(["#CEA21B", "#1D7BA4"]);



		x0.domain(data.map(function(d) {return d.c; }));
		x1.domain(keys).rangeRound([0, x0.bandwidth()]);
		y.domain([0, d3.max(data, function(d) { return d3.max(keys, function(key) { return d[key]; }); })]).nice();




		g.append("g")
			.selectAll("g")
			.data(data)
			.enter().append("g")
			.attr("transform", function(d) {return "translate(" + x0(d.c) + ",0)"; })
			.selectAll("rect")
			.data(function(d) { return keys.map(function(key) { return { key: key, value: d[key] }; }); })
			.enter().append("rect")
			.attr("x", function(d) { return x1(d.key); })
			.attr("y", function(d) { return y(0); })
			.attr("width", x1.bandwidth())
			.attr("height", 0)
			.transition()
			.duration(3000)
			.attr("y", function(d) { return y(d.value); })
			.attr("height", function(d) { return height2 - y(d.value); })
			.attr("fill", function(d) { return z(d.key); });

		g.append("g")
			.attr("class", "axis")
			.attr("transform", "translate(0," + height2 + ")")
			.call(d3.axisBottom(x0));

		g.append("g")
			.attr("class", "axis")
			.call(d3.axisLeft(y).ticks(null, "s"))
			.append("text").attr("fill", "#7DA0AC")
			.attr("x", 2)
			.attr("y", y(y.ticks().pop()) + 0.5)
			.attr("dy", "0.5em")
			.attr("font-weight", "bold")
			.attr("text-anchor", "start")
			
			
			
			/*var svg3 = d3.select("#gongyingliang2"),
			margin = { top: 20, right: 20, bottom: 30, left: 40 },
			width3 = +svg3.attr("width") - margin.left - margin.right,
			height3 = +svg3.attr("height") - margin.top - margin.bottom,
			g3 = svg3.append("g").attr("transform", "translate(" + margin.left + "," + margin.top + ")");

			var g3x0 = d3.scaleBand()
				.rangeRound([0, width3])
				.paddingInner(0.5);
	
			var g3x1 = d3.scaleBand()
				.padding(0.05);
	
			var g3y = d3.scaleLinear()
				.rangeRound([height3, 0]);
	
			var g3z = d3.scaleOrdinal()
				.range(["#CEA21B", "#1D7BA4"]);

			g3x0.domain(data.map(function(d) {return d.c; }));
			g3x1.domain(keys).rangeRound([0, x0.bandwidth()]);
			g3y.domain([0, d3.max(data, function(d) { return d3.max(keys, function(key) { return d[key]; }); })]).nice();

			g3.append("g")
				.selectAll("g")
				.data(data)
				.enter().append("g")
				.attr("transform", function(d) {return "translate(" + x0(d.c) + ",0)"; })
				.selectAll("rect")
				.data(function(d) { return keys.map(function(key) { return { key: key, value: d[key] }; }); })
				.enter().append("rect")
				.attr("x", function(d) { return x1(d.key); })
				.attr("y", function(d) { return y(0); })
				.attr("width", x1.bandwidth())
				.attr("height", 0)
				.transition()
				.duration(3000)
				.attr("y", function(d) { return y(d.value); })
				.attr("height", function(d) { return height3 - y(d.value); })
				.attr("fill", function(d) { return z(d.key); });
	
			g3.append("g")
				.attr("class", "axis")
				.attr("transform", "translate(0," + height3 + ")")
				.call(d3.axisBottom(x0));
	
			g3.append("g")
				.attr("class", "axis")
				.call(d3.axisLeft(g3y).ticks(null, "s"))
				.append("text").attr("fill", "#7DA0AC")
				.attr("x", 2)
				.attr("y", g3y(g3y.ticks().pop()) + 0.5)
				.attr("dy", "0.5em")
				.attr("font-weight", "bold")
				.attr("text-anchor", "start")*/
			
			
		/*$(".axis:eq(0) text[fill=#AAA]").attr("fill","#7DA0AC")
		$(".axis:eq(1) text[fill=#AAA]").attr("fill","#145C75")
		$(".domain").attr("stroke","#145C75")
		$(".axis line").attr("stroke","#145C75")*/
		$("text").attr("fill","#7DA0AC")
		$(".domain").attr("stroke","#145C75")
		$("line").attr("stroke","#145C75")


	});
}

function parseJson(jsonstr)
{
	var str = jsonstr.replace(/(^\s*)|(\s*$)|\n/g, '');
	return JSON.parse(str);
}




$(function() {


	var p_num = 0;

	setInterval(function() {
		$(".map-point").eq(p_num).css({
			'width': '600px',
			'height': '400px',
			'z-index': '10',
			'border': '5px solid #7fcff7'
		});
		setTimeout(function() {
			$(".map-point").eq(p_num).find(".content").css({
				'filter': ' progid: DXImageTransform.Microsoft.Alpha(Opacity=80)',
				'opacity': ' 0.8'
			});
		}, 1000)
		setTimeout(function() {
			$(".map-point").eq(p_num).css({
				'width': '0px',
				'height': '0px',
				'z-index': '1',
				'border': '0px solid #7fcff7'
			});
			$(".map-point").eq(p_num).find(".content").css({
				'filter': ' progid: DXImageTransform.Microsoft.Alpha(Opacity=0)',
				'opacity': ' 0'
			});
			if(p_num >= max_pnmu) {
				p_num = 0
			} else {
				p_num++
			}
		}, 5000)
	}, 7000);

});

// 第二屏 闪烁的点
function flashFun() {
	var flashDot = $('.flashesDot div');
	var flashNum = flashDot.length;
	var flashRandom = [];
	for(var i = 0; i < flashNum; i++) {
		flashRandom.push(Math.round(Math.random()));
	}
	flashDot.each(function(index) {
		if(flashRandom[index] == 0) {
			$(this).fadeOut(600);
		} else {
			$(this).fadeIn(600);
		}
	});
}
flashFun();
setInterval(function() {
	flashFun();
}, 4000);

// 弹出层 嘉定 预订率对比图
// function jdzhuztFun() {
// 	var _span = $('.jdzhuzt div span');
// 	var zongW = $('.jdzhuzt').width() * 2.5;
// 	_span.each(function() {
// 		jdzhuztWidthFun($(this), parseInt($(this).attr('_width')), zongW);
// 	});
// }
//
// function jdzhuztWidthFun(e, w, zongW) {
// 	var num = 0;
// 	var speed = 8;
// 	var jdTimer = setInterval(function() {
// 		// num = num + 2 * 1.2;
// 		num = num + 2;
// 		if(num <= w) {
// 			e.css({
// 				'width': num
// 			});
// 			e.siblings('em').text(Math.round(num / zongW * 10000) / 100 + "%");
// 		} else {
// 			e.css({
// 				'width': w
// 			});
// 			e.siblings('em').text(Math.round(w / zongW * 10000) / 100 + "%");
// 			clearInterval(jdTimer);
// 		}
// 	}, speed);
// }

// 弹出层 凌云社区 用户年龄分布
function lingyageFun() {
	var _span = $('.lingyage div span');
	var zongW = $('.lingyage').width() * 2;
	_span.each(function() {
		lingyageWidthFun($(this), parseInt($(this).attr('_width')), zongW);
	});
}

function lingyageWidthFun(e, w, zongW) {
	var num = 0;
	var speed = 8;
	var jdTimer = setInterval(function() {
		// num = num + 2 * 1.2;
		num = num + 2;
		if(num <= w) {
			e.css({
				'width': num
			});
			e.siblings('em').text(Math.round(num / zongW * 100) + "%");
		} else {
			e.css({
				'width': w
			});
			e.siblings('em').text(Math.round(w / zongW * 100) + "%");
			clearInterval(jdTimer);
		}
	}, speed);
}

// 弹出层 嘉定和凌云社区  清零效果
function jdclearFun(ele) {
	ele.css({
		'width': 0
	});
}
// jdclearFun($('.jdzhuzt div span'))
// jdclearFun($('.lingyage div span'))

// 弹出层 凌云社区 荷包蛋
function drawDot(ele, sum, _width, _height) {
	var i = 0,
		j = 0,
		amount = 0;
	var lyTimer1 = setInterval(function() {
		if(amount < sum) {
			i = Math.floor(Math.random() * _width - 1);
			j = Math.floor(Math.random() * _height - 1);
			var dot = '<div style="left:' + i + 'px;top:' + j + 'px;"></div>';
			ele.append(dot);
			amount++;
		} else {
			clearInterval(lyTimer1);
		}

	}, 1);
}

// 随机打乱一个数组
function randowArr(arr) {
	arr.sort(function() {
		return 0.5 - Math.random()
	})
	return arr;
}

function drawShans() {
	var size = $('.lingyeggs .shans_wc .shans').length;
	var arr = [];
	for(var i = 0; i < size; i++) {
		arr[i] = i;
	}
	var newArr = randowArr(arr);
	var js = 0;
	var dTimer = setInterval(function() {
		if(js < size) {
			$('.lingyeggs .shans_wc .shans').eq(newArr[js]).fadeIn(200);
			js++;
		} else {
			clearInterval(dTimer);
		}

	}, 300);

}

function lingyunEggs() {

	$('.lingyeggs .eggs_6').addClass('xian');
	drawDot($('.lingyeggs .eggs_5'), 500, 172, 172);
	setTimeout(function() {
		$('.lingyeggs .eggs_3').addClass('xian');
	}, 2000);

	setTimeout(function() {
		$('.lingyeggs .fanw_1').addClass('xian');
	}, 3000);
	setTimeout(function() {
		$('.lingyeggs .fanw_1 img').addClass('shang');
	}, 3100);

	setTimeout(function() {
		drawDot($('.lingyeggs .eggs_4'), 800, 327, 276);
	}, 2800);
	setTimeout(function() {
		$('.lingyeggs .eggs_2').addClass('xian');
	}, 5800);
	setTimeout(function() {
		$('.lingyeggs .fanw_2').addClass('xian');
	}, 6800);
	setTimeout(function() {
		$('.lingyeggs .fanw_2 img').addClass('shang');
	}, 6900);

	setTimeout(function() {
		$('.lingyeggs .eggs_1').addClass('xian');
	}, 7400);
	setTimeout(function() {
		$('.lingyeggs .fanw_3').addClass('xian');
	}, 8400);
	setTimeout(function() {
		$('.lingyeggs .fanw_3 img').addClass('shang');
	}, 8500);

	setTimeout(function() {
		drawShans();
	}, 8500);

	setTimeout(function() {
		$('.lingyeggs .eggs_8').addClass('xian');
	}, 10000);
	setTimeout(function() {
		$('.lingyeggs .eggs_8 img').addClass('shang');
	}, 10800);
	setTimeout(function() {
		$('.lingyeggs .eggs_9').fadeIn(300);
	}, 10800);

	// setTimeout(function () {
	// 	$('.lingyeggs .eggs_7').addClass('xian');
	// }, 10400);
	// setTimeout(function () {
	// 	$('.lingyeggs .eggs_7 img').addClass('shang');
	// }, 10900);
}

// 弹出层 凌云社区 荷包蛋清零
function drawclear() {
	$('.lingyeggs .eggs_6, .lingyeggs .eggs_3, .lingyeggs .eggs_2, .lingyeggs .eggs_1').removeClass('xian');
	$('.lingyeggs .eggs_5').html('');
	$('.lingyeggs .eggs_4').html('');
	$('.lingyeggs .eggs_8 img, .lingyeggs .fanw_1 img, .lingyeggs .fanw_2 img, .lingyeggs .fanw_3 img').removeClass('shang');
	$('.lingyeggs .eggs_8, .lingyeggs .fanw_1, .lingyeggs .fanw_2, .lingyeggs .fanw_3').removeClass('xian');
	$('.lingyeggs .shans, .lingyeggs .eggs_9').css({
		'display': 'none'
	});

}

// 自动播放

//	setTimeout(function () {
//		$('.mainCoverJD').fadeIn(1000, function () {
//			jdzhuztFun();
//		});
//	}, 24000);
//	setTimeout(function () {
//		$('.mainCoverJD').fadeOut(1000,function () {
//			jdclearFun($('.jdzhuzt div span'));
//		});
//		$('.mainCoverLY').fadeIn(1000, function () {
//			lingyageFun();
//			lingyunEggs();
//		});
//	}, 32000);
//	setTimeout(function () {
//		$('.mainCoverLY').fadeOut(1000, function () {
//			jdclearFun($('.lingyage div span'))
//		});
//		$('.mainCoverSJ').fadeIn(1000);
//	}, 48000);
//	setTimeout(function () {
//		$('.mainCoverSJ').fadeOut(1000);
//
//	}, 60000);

//	setInterval(function () {
//		setTimeout(function () {
//			$('.mainCoverJD').fadeIn(1000, function () {
//				jdzhuztFun();
//				drawclear();
//			});
//		}, 24000);
//		setTimeout(function () {
//			$('.mainCoverJD').fadeOut(1000,function () {
//				jdclearFun($('.jdzhuzt div span'));
//			});
//			$('.mainCoverLY').fadeIn(1000, function () {
//				lingyageFun();
//				lingyunEggs();
//			});
//		}, 33000);
//		setTimeout(function () {
//			$('.mainCoverLY').fadeOut(1000, function () {
//				jdclearFun($('.lingyage div span'));
//				drawclear();
//			});
//			$('.mainCoverSJ').fadeIn(1000);
//		}, 48000);
//		setTimeout(function () {
//			$('.mainCoverSJ').fadeOut(1000);
//		}, 60000);
//
//	}, 60000);




function venueData(){
	var venue_name = areaName(areaPlaceNum);
	$("#huodongqushitu").children().remove()
	$("#yonghuqushitu").children().remove()
	
	$.ajax({
		async:'false',
		url:'getdata.jsp?uid=22',
		success: function(data){
			var jsondata = parseJson(data);
			var total = jsondata["total"];
			var timesegment = jsondata["timesegment"];
			var lineChart_orderList = new Array();
			var lineChart_actNumList = new Array();
			
			
			
			for(var i = 0; i < jsondata.timesegment.length;i++){
				//折线图数据
				if(venue_name == jsondata.timesegment[i].venue_name){
					var lineChart_orderObj = new Object();
					lineChart_orderObj.x = parseInt(jsondata.timesegment[i].month.split('-')[1]);
					lineChart_orderObj.y = jsondata.timesegment[i].orderNum;
					lineChart_orderList.push(lineChart_orderObj);
				}
				
				if(venue_name == jsondata.timesegment[i].venue_name){
					var lineChart_actNumObj = new Object();
					lineChart_actNumObj.x = parseInt(jsondata.timesegment[i].month.split('-')[1]);
					lineChart_actNumObj.y = jsondata.timesegment[i].actNum;
					lineChart_actNumList.push(lineChart_actNumObj);
				}
			}				
			
			for(var i=0;i<total.length;i++)
			{
			
				if(venue_name == total[i]["venue_name"])
				{
					var datavenue = $("#venuedata");
					datavenue.find("div.venuename").html(total[i]["venue_name"]);
					datavenue.find("span.venueact").html(total[i]["actNum"]);
					datavenue.find("span.venuepv").html(total[i]["pv"]);
					datavenue.find("span.orderNum").html(total[i]["orderNum"]);
					datavenue.find("span.peopleNum").html(total[i]["peopleNum"]);

					var fa = total[i]["favorite"].split(",")
					if(fa.length >= 4)
					{
						var totalnum = 0;
						var totalrate = 0;
						for(var x=0;x<4;x++)
						{
							totalnum += parseInt(fa[x].substring(fa[x].indexOf(":")+1))
						}

						for(var x=0;x<4;x++)
						{
							var num;
							if(x < 3)
							{
								num = parseInt(fa[x].substring(fa[x].indexOf(":")+1))
								num = Math.floor(num / totalnum * 100);
								// if(num == 0)
								// {
								// 	num = 1
								// }
								totalrate += num;
							}
							else
							{
								num = 100-totalrate
							}
							datavenue.find("div.favorite"+(x+1)).html(fa[x].substring(0,fa[x].indexOf(":")));
							datavenue.find("div.favorite"+(x+1)+"num").html(num);
						}

					}

					var female = total[i]["femaleNum"];
					var male = total[i]["maleNum"];
					var males= Math.floor((female / (female + male) * 100))
					var females = 100 - males;
					datavenue.find("div.male").html(males+'');
					datavenue.find("div.female").html(females+'');
						
					$(".proportion").html(Math.round(males/10) + ":" + (10-Math.round(males/10)))
				}
			}
			
			lineChart('huodongqushitu',lineChart_actNumList,'month')
			lineChart('yonghuqushitu',lineChart_orderList,'month')
			
			
			var chartData = new Array();
			for(var i=0;i<timesegment.length;i++)
			{
				if(venue_name == timesegment[i]["venue_name"])
				{
					chartData.push(timesegment[i]);
				}
			}
	    }
	})
	$(".mainCoverVenue").fadeIn(1000);
}





function ctrl(num) {
	if(fuc_num == num) {
		return
	}
	fuc_num = num;
	switch(fuc_num) {
		case '0':
			clearData()
			drawclear();
			jdclearFun($('.lingyage div span'))
			break;

		case '1':
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);	
			break;
			
		case '2':
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);	
			break;
			
		case '3':
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);	
			break;
			
		case '4':
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);	
			break;
		case '5':
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);	
			break;
		case '6':
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);	
			break;
		case '7':
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);	
			break;
		case '8':
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);	
			break;
		case '9':
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);	
			break;
		case '10':
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);	
			break;
		case '11':	
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);	
			break;
		case '12':
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);
			break;
		case '85':
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);
			break;
		case '86':
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);
			break;
		case '87':
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);
			break;
		case '88':
			clearData()
			test()
			$('.mainCoverJD').fadeIn(2000);
			break;
			
			
		//绩效大数据
		case '2017.01':
			clearData()
			assessData()
			$('#assessData').fadeIn(2000);
			break;
		case '2017.02':
			clearData()
			assessData()
			$('#assessData').fadeIn(2000);
			break;
		case '2017.03':
			clearData()
			assessData()
			$('#assessData').fadeIn(2000);
			break;
		case '2017.04':
			clearData()
			assessData()
			$('#assessData').fadeIn(2000);
			break;
		case '2017.05':
			clearData()
			assessData()
			$('#assessData').fadeIn(2000);
			break;
		case '2017.06':
			clearData()
			assessData()
			$('#assessData').fadeIn(2000);
			break;
		case '2017.07':
			clearData()
			assessData()
			$('#assessData').fadeIn(2000);
			break;
		case '2017.08':
			clearData()
			assessData()
			$('#assessData').fadeIn(2000);
			break;
		case '2017.09':
			clearData()
			assessData()
			$('#assessData').fadeIn(2000);
			break;
		case '2017.10':
			clearData()
			assessData()
			$('#assessData').fadeIn(2000);
			break;
		case '2017.11':
			clearData()
			assessData()
			$('.#assessData').fadeIn(2000);
			break;
		case '2017.12':
			clearData()
			assessData()
			$('#assessData').fadeIn(2000);
			break;
		case 'all':
			clearData()
			assessData()
			$('#assessData').fadeIn(2000);
			break;
			
		case 'all':
			clearData()
			assessData()
			$('#assessImg').fadeIn(2000);
			break;
			
		case 'assessDiv':
			clearData()
			$('#assessImg').fadeIn(2000);
			$('#ystk').get(0).play();
			if(_swiper == 0){
				var mySwiper = new Swiper('.swiper-container', {
				  autoplay:true,
				  loop : true,
				});
			}
			break;
			
		case 'assessDiv2':
			clearData()
			$('#assessImg2').fadeIn(2000);
			$('#ystk2').get(0).play();
			if(_swiper == 0){
				var mySwiper = new Swiper('.swiper-container', {
				  autoplay:true,
				  loop : true,
				});
			}
			break;
			
		case 'assessDiv3':
			clearData()
			$('#assessImg3').fadeIn(2000);
			$('#ystk3').get(0).play();
			if(_swiper == 0){
				var mySwiper = new Swiper('.swiper-container', {
				  autoplay:true,
				  loop : true,
				});
			}
			break;
			
		case 'assessDiv4':
			clearData()
			$('#assessImg4').fadeIn(2000);
			$('#ystk4').get(0).play();
			if(_swiper == 0){
				var mySwiper = new Swiper('.swiper-container', {
				  autoplay:true,
				  loop : true,
				});
			}
			break;
		case 'assessDiv5':
			clearData()
			$('#assessImg5').fadeIn(2000);
			$('#ystk5').get(0).play();
			if(_swiper == 0){
				var mySwiper = new Swiper('.swiper-container', {
				  autoplay:true,
				  loop : true,
				});
			}
			break;
		case 'assessDiv6':
			clearData()
			$('#assessImg6').fadeIn(2000);
			$('#ystk6').get(0).play();
			if(_swiper == 0){
				var mySwiper = new Swiper('.swiper-container', {
				  autoplay:true,
				  loop : true,
				});
			}
			break;
			
			
			
			
		default:
			clearData()
			venueData();
			
			break;
			

		/*case '13':
			clearData()
			$('.mainCoverLY').fadeIn(1000, function() {
				lingyageFun();
				lingyunEggs();
			});
			break;

		case '14':
			clearData()
			$('.mainCoverSJ').fadeIn(1000);
			break;*/
	}
}